TexasInstruments/f29h85x-sdk/source/driverlib/inc/hw_adc.h
//###########################################################################
//
// FILE:    hw_adc.h
//
// TITLE:   Definitions for the ADC registers.
//
//###########################################################################
// //
//	Copyright: Copyright (C) Texas Instruments Incorporated
//	All rights reserved not granted herein.
//
//  Redistribution and use in source and binary forms, with or without 
//  modification, are permitted provided that the following conditions 
//  are met:
//
//  Redistributions of source code must retain the above copyright 
//  notice, this list of conditions and the following disclaimer.
//
//  Redistributions in binary form must reproduce the above copyright
//  notice, this list of conditions and the following disclaimer in the 
//  documentation and/or other materials provided with the   
//  distribution.
//
//  Neither the name of Texas Instruments Incorporated nor the names of
//  its contributors may be used to endorse or promote products derived
//  from this software without specific prior written permission.
//
//  THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS 
//  "AS IS" AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT 
//  LIMITED TO, THE IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR
//  A PARTICULAR PURPOSE ARE DISCLAIMED. IN NO EVENT SHALL THE COPYRIGHT 
//  OWNER OR CONTRIBUTORS BE LIABLE FOR ANY DIRECT, INDIRECT, INCIDENTAL, 
//  SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING, BUT NOT 
//  LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS OF USE,
//  DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND ON ANY
//  THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT 
//  (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE 
//  OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
//

//###########################################################################

#ifndef HW_ADC_H
#define HW_ADC_H

//*************************************************************************************************
//
// The following are defines for the ADC register offsets
//
//*************************************************************************************************
#define ADC_O_CTL1                0x0U     // ADC Control 1 Register
#define ADC_O_CTL2                0x2U     // ADC Control 2 Register
#define ADC_O_BURSTCTL            0xCU     // ADC Burst Control Register
#define ADC_O_INTFLG              0xEU     // ADC Interrupt Flag Register
#define ADC_O_INTFLGCLR           0x10U    // ADC Interrupt Flag Clear Register
#define ADC_O_INTOVF              0x12U    // ADC Interrupt Overflow Register
#define ADC_O_INTOVFCLR           0x14U    // ADC Interrupt Overflow Clear Register
#define ADC_O_INTSEL1N2           0x16U    // ADC Interrupt 1 and 2 Selection Register
#define ADC_O_INTSEL3N4           0x18U    // ADC Interrupt 3 and 4 Selection Register
#define ADC_O_SOCPRICTL           0x1AU    // ADC SOC Priority Control Register
#define ADC_O_INTSOCSEL1          0x1CU    // ADC Interrupt SOC Selection 1 Register
#define ADC_O_INTSOCSEL2          0x20U    // ADC Interrupt SOC Selection 2 Register
#define ADC_O_SOCFLG1             0x24U    // ADC SOC Flag 1 Register
#define ADC_O_SOCFRC1             0x28U    // ADC SOC Force 1 Register
#define ADC_O_SOCOVF1             0x2CU    // ADC SOC Overflow 1 Register
#define ADC_O_SOCOVFCLR1          0x30U    // ADC SOC Overflow Clear 1 Register
#define ADC_O_SOC0CTL             0x34U    // ADC SOC0 Control Register
#define ADC_O_SOC1CTL             0x38U    // ADC SOC1 Control Register
#define ADC_O_SOC2CTL             0x3CU    // ADC SOC2 Control Register
#define ADC_O_SOC3CTL             0x40U    // ADC SOC3 Control Register
#define ADC_O_SOC4CTL             0x44U    // ADC SOC4 Control Register
#define ADC_O_SOC5CTL             0x48U    // ADC SOC5 Control Register
#define ADC_O_SOC6CTL             0x4CU    // ADC SOC6 Control Register
#define ADC_O_SOC7CTL             0x50U    // ADC SOC7 Control Register
#define ADC_O_SOC8CTL             0x54U    // ADC SOC8 Control Register
#define ADC_O_SOC9CTL             0x58U    // ADC SOC9 Control Register
#define ADC_O_SOC10CTL            0x5CU    // ADC SOC10 Control Register
#define ADC_O_SOC11CTL            0x60U    // ADC SOC11 Control Register
#define ADC_O_SOC12CTL            0x64U    // ADC SOC12 Control Register
#define ADC_O_SOC13CTL            0x68U    // ADC SOC13 Control Register
#define ADC_O_SOC14CTL            0x6CU    // ADC SOC14 Control Register
#define ADC_O_SOC15CTL            0x70U    // ADC SOC15 Control Register
#define ADC_O_SOC16CTL            0x74U    // ADC SOC16 Control Register
#define ADC_O_SOC17CTL            0x78U    // ADC SOC17 Control Register
#define ADC_O_SOC18CTL            0x7CU    // ADC SOC18 Control Register
#define ADC_O_SOC19CTL            0x80U    // ADC SOC19 Control Register
#define ADC_O_SOC20CTL            0x84U    // ADC SOC20 Control Register
#define ADC_O_SOC21CTL            0x88U    // ADC SOC21 Control Register
#define ADC_O_SOC22CTL            0x8CU    // ADC SOC22 Control Register
#define ADC_O_SOC23CTL            0x90U    // ADC SOC23 Control Register
#define ADC_O_SOC24CTL            0x94U    // ADC SOC24 Control Register
#define ADC_O_SOC25CTL            0x98U    // ADC SOC25 Control Register
#define ADC_O_SOC26CTL            0x9CU    // ADC SOC26 Control Register
#define ADC_O_SOC27CTL            0xA0U    // ADC SOC27 Control Register
#define ADC_O_SOC28CTL            0xA4U    // ADC SOC28 Control Register
#define ADC_O_SOC29CTL            0xA8U    // ADC SOC29 Control Register
#define ADC_O_SOC30CTL            0xACU    // ADC SOC30 Control Register
#define ADC_O_SOC31CTL            0xB0U    // ADC SOC31 Control Register
#define ADC_O_EVTSTAT             0xB4U    // ADC Event Status Register
#define ADC_O_EVTCLR              0xB8U    // ADC Event Clear Register
#define ADC_O_EVTSEL              0xBCU    // ADC Event Selection Register
#define ADC_O_EVTINTSEL           0xC0U    // ADC Event Interrupt Selection Register
#define ADC_O_OSDETECT            0xC4U    // ADC Open and Shorts Detect Register
#define ADC_O_COUNTER             0xC6U    // ADC Counter Register
#define ADC_O_REV                 0xC8U    // ADC Revision Register
#define ADC_O_OFFTRIM             0xCAU    // ADC Offset Trim Register 1
#define ADC_O_OFFTRIM2            0xCCU    // ADC Offset Trim Register 2
#define ADC_O_OFFTRIM3            0xCEU    // ADC Offset Trim Register 3
#define ADC_O_PPB1CONFIG          0xD4U    // ADC PPB{#} Config Register
#define ADC_O_PPB1STAMP           0xD6U    // ADC PPB1 Sample Delay Time Stamp Register
#define ADC_O_PPB1OFFCAL          0xD8U    // ADC PPB1 Offset Calibration Register
#define ADC_O_PPB1OFFREF          0xDAU    // ADC PPB1 Offset Reference Register
#define ADC_O_PPB1TRIPHI          0xDCU    // ADC PPB1 Trip High Register
#define ADC_O_PPB1TRIPLO          0xE0U    // ADC PPB1 Trip Low/Trigger Time Stamp Register
#define ADC_O_PPBTRIP1FILCTL      0xE4U    // ADCEVT1 Trip High Filter Control Register
#define ADC_O_PPBTRIP1FILCLKCTL   0xE8U    // ADCEVT1 Trip High Filter Prescale Control Register
#define ADC_O_PPB2CONFIG          0xF4U    // ADC PPB{#} Config Register
#define ADC_O_PPB2STAMP           0xF6U    // ADC PPB2 Sample Delay Time Stamp Register
#define ADC_O_PPB2OFFCAL          0xF8U    // ADC PPB2 Offset Calibration Register
#define ADC_O_PPB2OFFREF          0xFAU    // ADC PPB2 Offset Reference Register
#define ADC_O_PPB2TRIPHI          0xFCU    // ADC PPB2 Trip High Register
#define ADC_O_PPB2TRIPLO          0x100U   // ADC PPB2 Trip Low/Trigger Time Stamp Register
#define ADC_O_PPBTRIP2FILCTL      0x104U   // ADCEVT2 Trip High Filter Control Register
#define ADC_O_PPBTRIP2FILCLKCTL   0x108U   // ADCEVT2 Trip High Filter Prescale Control Register
#define ADC_O_PPB3CONFIG          0x114U   // ADC PPB{#} Config Register
#define ADC_O_PPB3STAMP           0x116U   // ADC PPB3 Sample Delay Time Stamp Register
#define ADC_O_PPB3OFFCAL          0x118U   // ADC PPB3 Offset Calibration Register
#define ADC_O_PPB3OFFREF          0x11AU   // ADC PPB3 Offset Reference Register
#define ADC_O_PPB3TRIPHI          0x11CU   // ADC PPB3 Trip High Register
#define ADC_O_PPB3TRIPLO          0x120U   // ADC PPB3 Trip Low/Trigger Time Stamp Register
#define ADC_O_PPBTRIP3FILCTL      0x124U   // ADCEVT3 Trip High Filter Control Register
#define ADC_O_PPBTRIP3FILCLKCTL   0x128U   // ADCEVT3 Trip High Filter Prescale Control Register
#define ADC_O_PPB4CONFIG          0x134U   // ADC PPB{#} Config Register
#define ADC_O_PPB4STAMP           0x136U   // ADC PPB4 Sample Delay Time Stamp Register
#define ADC_O_PPB4OFFCAL          0x138U   // ADC PPB4 Offset Calibration Register
#define ADC_O_PPB4OFFREF          0x13AU   // ADC PPB4 Offset Reference Register
#define ADC_O_PPB4TRIPHI          0x13CU   // ADC PPB4 Trip High Register
#define ADC_O_PPB4TRIPLO          0x140U   // ADC PPB4 Trip Low/Trigger Time Stamp Register
#define ADC_O_PPBTRIP4FILCTL      0x144U   // ADCEVT4 Trip High Filter Control Register
#define ADC_O_PPBTRIP4FILCLKCTL   0x148U   // ADCEVT4 Trip High Filter Prescale Control Register
#define ADC_O_SAFECHECKRESEN      0x154U   // ADC Safe Check Result Enable Register
#define ADC_O_SAFECHECKRESEN2     0x158U   // ADC Safe Check Result Enable 2 Register
#define ADC_O_INTCYCLE            0x172U   // ADC Early Interrupt Generation Cycle
#define ADC_O_INLTRIM1            0x174U   // ADC Linearity Trim 1 Register
#define ADC_O_INLTRIM2            0x178U   // ADC Linearity Trim 2 Register
#define ADC_O_INLTRIM3            0x17CU   // ADC Linearity Trim 3 Register
#define ADC_O_INLTRIM4            0x180U   // ADC Linearity Trim 4 Register
#define ADC_O_INLTRIM5            0x184U   // ADC Linearity Trim 5 Register
#define ADC_O_INLTRIM6            0x188U   // ADC Linearity Trim 6 Register
#define ADC_O_REV2                0x18EU   // ADC Wrapper Revision Register
#define ADC_O_REP1CTL             0x194U   // ADC Trigger Repeater 1 Control Register
#define ADC_O_REP1N               0x198U   // ADC Trigger Repeater 1 N Select Register
#define ADC_O_REP1PHASE           0x19CU   // ADC Trigger Repeater 1 Phase Select Register
#define ADC_O_REP1SPREAD          0x1A0U   // ADC Trigger Repeater 1 Spread Select Register
#define ADC_O_REP1FRC             0x1A4U   // ADC Trigger Repeater 1 Software Force Register
#define ADC_O_REP2CTL             0x1B4U   // ADC Trigger Repeater 2 Control Register
#define ADC_O_REP2N               0x1B8U   // ADC Trigger Repeater 2 N Select Register
#define ADC_O_REP2PHASE           0x1BCU   // ADC Trigger Repeater 2 Phase Select Register
#define ADC_O_REP2SPREAD          0x1C0U   // ADC Trigger Repeater 2 Spread Select Register
#define ADC_O_REP2FRC             0x1C4U   // ADC Trigger Repeater 2 Software Force Register
#define ADC_O_PPB1LIMIT           0x1D4U   // ADC PPB1Conversion Count Limit Register
#define ADC_O_PPBP1PCOUNT         0x1D8U   // ADC PPB1 Partial Conversion Count Register
#define ADC_O_PPB1CONFIG2         0x1DCU   // ADC PPB1 Sum Shift Register
#define ADC_O_PPB1PSUM            0x1E0U   // ADC PPB1 Partial Sum Register
#define ADC_O_PPB1PMAX            0x1E4U   // ADC PPB1 Partial Max Register
#define ADC_O_PPB1PMAXI           0x1E8U   // ADC PPB1 Partial Max Index Register
#define ADC_O_PPB1PMIN            0x1ECU   // ADC PPB1 Partial MIN Register
#define ADC_O_PPB1PMINI           0x1F0U   // ADC PPB1 Partial Min Index Register
#define ADC_O_PPB1TRIPLO2         0x1F4U   // ADC PPB1 Extended Trip Low Register
#define ADC_O_PPB2LIMIT           0x208U   // ADC PPB2Conversion Count Limit Register
#define ADC_O_PPBP2PCOUNT         0x20CU   // ADC PPB2 Partial Conversion Count Register
#define ADC_O_PPB2CONFIG2         0x210U   // ADC PPB2 Sum Shift Register
#define ADC_O_PPB2PSUM            0x214U   // ADC PPB2 Partial Sum Register
#define ADC_O_PPB2PMAX            0x218U   // ADC PPB2 Partial Max Register
#define ADC_O_PPB2PMAXI           0x21CU   // ADC PPB2 Partial Max Index Register
#define ADC_O_PPB2PMIN            0x220U   // ADC PPB2 Partial MIN Register
#define ADC_O_PPB2PMINI           0x224U   // ADC PPB2 Partial Min Index Register
#define ADC_O_PPB2TRIPLO2         0x228U   // ADC PPB2 Extended Trip Low Register
#define ADC_O_PPB3LIMIT           0x23CU   // ADC PPB3Conversion Count Limit Register
#define ADC_O_PPBP3PCOUNT         0x240U   // ADC PPB3 Partial Conversion Count Register
#define ADC_O_PPB3CONFIG2         0x244U   // ADC PPB3 Sum Shift Register
#define ADC_O_PPB3PSUM            0x248U   // ADC PPB3 Partial Sum Register
#define ADC_O_PPB3PMAX            0x24CU   // ADC PPB3 Partial Max Register
#define ADC_O_PPB3PMAXI           0x250U   // ADC PPB3 Partial Max Index Register
#define ADC_O_PPB3PMIN            0x254U   // ADC PPB3 Partial MIN Register
#define ADC_O_PPB3PMINI           0x258U   // ADC PPB3 Partial Min Index Register
#define ADC_O_PPB3TRIPLO2         0x25CU   // ADC PPB3 Extended Trip Low Register
#define ADC_O_PPB4LIMIT           0x270U   // ADC PPB4Conversion Count Limit Register
#define ADC_O_PPBP4PCOUNT         0x274U   // ADC PPB4 Partial Conversion Count Register
#define ADC_O_PPB4CONFIG2         0x278U   // ADC PPB4 Sum Shift Register
#define ADC_O_PPB4PSUM            0x27CU   // ADC PPB4 Partial Sum Register
#define ADC_O_PPB4PMAX            0x280U   // ADC PPB4 Partial Max Register
#define ADC_O_PPB4PMAXI           0x284U   // ADC PPB4 Partial Max Index Register
#define ADC_O_PPB4PMIN            0x288U   // ADC PPB4 Partial MIN Register
#define ADC_O_PPB4PMINI           0x28CU   // ADC PPB4 Partial Min Index Register
#define ADC_O_PPB4TRIPLO2         0x290U   // ADC PPB4 Extended Trip Low Register

#define ADC_O_RESULT0      0x0U    // ADC Result 0 Register
#define ADC_O_RESULT1      0x2U    // ADC Result 1 Register
#define ADC_O_RESULT2      0x4U    // ADC Result 2 Register
#define ADC_O_RESULT3      0x6U    // ADC Result 3 Register
#define ADC_O_RESULT4      0x8U    // ADC Result 4 Register
#define ADC_O_RESULT5      0xAU    // ADC Result 5 Register
#define ADC_O_RESULT6      0xCU    // ADC Result 6 Register
#define ADC_O_RESULT7      0xEU    // ADC Result 7 Register
#define ADC_O_RESULT8      0x10U   // ADC Result 8 Register
#define ADC_O_RESULT9      0x12U   // ADC Result 9 Register
#define ADC_O_RESULT10     0x14U   // ADC Result 10 Register
#define ADC_O_RESULT11     0x16U   // ADC Result 11 Register
#define ADC_O_RESULT12     0x18U   // ADC Result 12 Register
#define ADC_O_RESULT13     0x1AU   // ADC Result 13 Register
#define ADC_O_RESULT14     0x1CU   // ADC Result 14 Register
#define ADC_O_RESULT15     0x1EU   // ADC Result 15 Register
#define ADC_O_RESULT16     0x20U   // ADC Result 16 Register
#define ADC_O_RESULT17     0x22U   // ADC Result 17 Register
#define ADC_O_RESULT18     0x24U   // ADC Result 18 Register
#define ADC_O_RESULT19     0x26U   // ADC Result 19 Register
#define ADC_O_RESULT20     0x28U   // ADC Result 20 Register
#define ADC_O_RESULT21     0x2AU   // ADC Result 21 Register
#define ADC_O_RESULT22     0x2CU   // ADC Result 22 Register
#define ADC_O_RESULT23     0x2EU   // ADC Result 23 Register
#define ADC_O_RESULT24     0x30U   // ADC Result 24 Register
#define ADC_O_RESULT25     0x32U   // ADC Result 25 Register
#define ADC_O_RESULT26     0x34U   // ADC Result 26 Register
#define ADC_O_RESULT27     0x36U   // ADC Result 27 Register
#define ADC_O_RESULT28     0x38U   // ADC Result 28 Register
#define ADC_O_RESULT29     0x3AU   // ADC Result 29 Register
#define ADC_O_RESULT30     0x3CU   // ADC Result 30 Register
#define ADC_O_RESULT31     0x3EU   // ADC Result 31 Register
#define ADC_O_PPB1RESULT   0x40U   // ADC Post Processing Block 1 Result Register
#define ADC_O_PPB2RESULT   0x44U   // ADC Post Processing Block 2 Result Register
#define ADC_O_PPB3RESULT   0x48U   // ADC Post Processing Block 3 Result Register
#define ADC_O_PPB4RESULT   0x4CU   // ADC Post Processing Block 4 Result Register
#define ADC_O_PPB1SUM      0x50U   // ADC PPB 1 Final Sum Result Register
#define ADC_O_PPB1COUNT    0x54U   // ADC PPB1 Final Conversion Count Register
#define ADC_O_PPB2SUM      0x58U   // ADC PPB 2 Final Sum Result Register
#define ADC_O_PPB2COUNT    0x5CU   // ADC PPB2 Final Conversion Count Register
#define ADC_O_PPB3SUM      0x60U   // ADC PPB 3 Final Sum Result Register
#define ADC_O_PPB3COUNT    0x64U   // ADC PPB3 Final Conversion Count Register
#define ADC_O_PPB4SUM      0x68U   // ADC PPB 4 Final Sum Result Register
#define ADC_O_PPB4COUNT    0x6CU   // ADC PPB4 Final Conversion Count Register
#define ADC_O_PPB1MAX      0x70U   // ADC PPB 1 Final Max Result Register
#define ADC_O_PPB1MAXI     0x74U   // ADC PPB 1 Final Max Index Result Register
#define ADC_O_PPB1MIN      0x78U   // ADC PPB 1 Final Min Result Register
#define ADC_O_PPB1MINI     0x7CU   // ADC PPB 1 Final Min Index Result Register
#define ADC_O_PPB2MAX      0x80U   // ADC PPB 2 Final Max Result Register
#define ADC_O_PPB2MAXI     0x84U   // ADC PPB 2 Final Max Index Result Register
#define ADC_O_PPB2MIN      0x88U   // ADC PPB 2 Final Min Result Register
#define ADC_O_PPB2MINI     0x8CU   // ADC PPB 2 Final Min Index Result Register
#define ADC_O_PPB3MAX      0x90U   // ADC PPB 3 Final Max Result Register
#define ADC_O_PPB3MAXI     0x94U   // ADC PPB 3 Final Max Index Result Register
#define ADC_O_PPB3MIN      0x98U   // ADC PPB 3 Final Min Result Register
#define ADC_O_PPB3MINI     0x9CU   // ADC PPB 3 Final Min Index Result Register
#define ADC_O_PPB4MAX      0xA0U   // ADC PPB 4 Final Max Result Register
#define ADC_O_PPB4MAXI     0xA4U   // ADC PPB 4 Final Max Index Result Register
#define ADC_O_PPB4MIN      0xA8U   // ADC PPB 4 Final Min Result Register
#define ADC_O_PPB4MINI     0xACU   // ADC PPB 4 Final Min Index Result Register

#define ADC_O_CHECKCONFIG    0x0U    // ADC Check Configuration Register
#define ADC_O_CHECKSTATUS    0x4U    // ADC Check Status Register
#define ADC_O_RESSEL1        0x8U    // ADC Check 1 Select Register
#define ADC_O_RESSEL2        0xCU    // ADC Check 2 Select Register
#define ADC_O_TOLERANCE      0x10U   // ADC Check Tolerance Register
#define ADC_O_CHECKRESULT1   0x18U   // ADC Check Captured Result 1
#define ADC_O_CHECKRESULT2   0x1CU   // ADC Check Captured Result 2

