TexasInstruments/f29h85x-sdk/source/driverlib/inc/hw_adc.h
#define ADC_O_OOTFLG           0x0U    // Checker Out-of-Tolerance Flag Register
#define ADC_O_OOTFLGCLR        0x4U    // Checker Out-of-Tolerance Flag Clear Register
#define ADC_O_RES1OVF          0x8U    // Checker Overflow Result 1 Flag Register
#define ADC_O_RES1OVFCLR       0xCU    // Checker Overflow Result 1 Flag Clear Register
#define ADC_O_RES2OVF          0x10U   // Checker Overflow Result 2 Flag Register
#define ADC_O_RES2OVFCLR       0x14U   // Checker Overflow Result 2 Flag Clear Register
#define ADC_O_CHECKINTFLG      0x18U   // Checker Interrupt Flag Register
#define ADC_O_CHECKINTFLGCLR   0x1CU   // Checker Interrupt Flag Clear Register
#define ADC_O_CHECKINTSEL1     0x20U   // Checker Interrupt Source Select Register 1
#define ADC_O_CHECKINTSEL2     0x24U   // Checker Interrupt Source Select Register 2
#define ADC_O_CHECKINTSEL3     0x28U   // Checker Interrupt Source Select Register 3
#define ADC_O_CHECKEVT1SEL1    0x30U   // Checker X-Bar EVT1 Source Select Register 1
#define ADC_O_CHECKEVT1SEL2    0x34U   // Checker X-Bar EVT1 Source Select Register 2
#define ADC_O_CHECKEVT1SEL3    0x38U   // Checker X-Bar EVT1 Source Select Register 3
#define ADC_O_CHECKEVT2SEL1    0x40U   // Checker X-Bar EVT2 Source Select Register 1
#define ADC_O_CHECKEVT2SEL2    0x44U   // Checker X-Bar EVT2 Source Select Register 2
#define ADC_O_CHECKEVT2SEL3    0x48U   // Checker X-Bar EVT2 Source Select Register 3
#define ADC_O_CHECKEVT3SEL1    0x50U   // Checker X-Bar EVT3 Source Select Register 1
#define ADC_O_CHECKEVT3SEL2    0x54U   // Checker X-Bar EVT3 Source Select Register 2
#define ADC_O_CHECKEVT3SEL3    0x58U   // Checker X-Bar EVT3 Source Select Register 3
#define ADC_O_CHECKEVT4SEL1    0x60U   // Checker X-Bar EVT4 Source Select Register 1
#define ADC_O_CHECKEVT4SEL2    0x64U   // Checker X-Bar EVT4 Source Select Register 2
#define ADC_O_CHECKEVT4SEL3    0x68U   // Checker X-Bar EVT4 Source Select Register 3


//*************************************************************************************************
//
// The following are defines for the bit fields in the ADCCTL1 register
//
//*************************************************************************************************
#define ADC_CTL1_INTPULSEPOS         0x4U      // ADC Interrupt Pulse Position
#define ADC_CTL1_ADCPWDNZ            0x80U     // ADC Power Down
#define ADC_CTL1_ADCBSYCHN_S         8U
#define ADC_CTL1_ADCBSYCHN_M         0x1F00U   // ADC Busy Channel
#define ADC_CTL1_ADCBSY              0x2000U   // ADC Busy
#define ADC_CTL1_EXTMUXPRESELECTEN   0x4000U   // External Mux Preselect Enable
#define ADC_CTL1_TDMAEN              0x8000U   // Enable Alternate DMA Timings

//*************************************************************************************************
//
// The following are defines for the bit fields in the ADCCTL2 register
//
//*************************************************************************************************
#define ADC_CTL2_PRESCALE_S    0U
#define ADC_CTL2_PRESCALE_M    0xFU     // ADC Clock Prescaler
#define ADC_CTL2_RESOLUTION    0x40U    // SOC Conversion Resolution
#define ADC_CTL2_SIGNALMODE    0x80U    // SOC Signaling Mode
#define ADC_CTL2_OFFTRIMMODE   0x100U   // Offset Trim Mode

//*************************************************************************************************
//
// The following are defines for the bit fields in the ADCBURSTCTL register
//
//*************************************************************************************************
#define ADC_BURSTCTL_BURSTTRIGSEL_S   0U
#define ADC_BURSTCTL_BURSTTRIGSEL_M   0x7FU     // SOC Burst Trigger Source Select
#define ADC_BURSTCTL_BURSTSIZE_S      8U
#define ADC_BURSTCTL_BURSTSIZE_M      0x1F00U   // SOC Burst Size Select
#define ADC_BURSTCTL_BURSTEN          0x8000U   // SOC Burst Mode Enable

//*************************************************************************************************
//
// The following are defines for the bit fields in the ADCINTFLG register
//
//*************************************************************************************************
#define ADC_INTFLG_ADCINT1         0x1U    // ADC Interrupt 1 Flag
#define ADC_INTFLG_ADCINT2         0x2U    // ADC Interrupt 2 Flag
#define ADC_INTFLG_ADCINT3         0x4U    // ADC Interrupt 3 Flag
#define ADC_INTFLG_ADCINT4         0x8U    // ADC Interrupt 4 Flag
#define ADC_INTFLG_ADCINT1RESULT   0x10U   // ADC Interrupt 1 Results Ready
#define ADC_INTFLG_ADCINT2RESULT   0x20U   // ADC Interrupt 2 Results Ready
#define ADC_INTFLG_ADCINT3RESULT   0x40U   // ADC Interrupt 3 Results Ready
#define ADC_INTFLG_ADCINT4RESULT   0x80U   // ADC Interrupt 4 Results Ready

//*************************************************************************************************
//
// The following are defines for the bit fields in the ADCINTFLGCLR register
//
//*************************************************************************************************
#define ADC_INTFLGCLR_ADCINT1   0x1U   // ADC Interrupt 1 Flag Clear
#define ADC_INTFLGCLR_ADCINT2   0x2U   // ADC Interrupt 2 Flag Clear
#define ADC_INTFLGCLR_ADCINT3   0x4U   // ADC Interrupt 3 Flag Clear
#define ADC_INTFLGCLR_ADCINT4   0x8U   // ADC Interrupt 4 Flag Clear

//*************************************************************************************************
//
// The following are defines for the bit fields in the ADCINTOVF register
//
//*************************************************************************************************
#define ADC_INTOVF_ADCINT1   0x1U   // ADC Interrupt 1 Overflow Flags
#define ADC_INTOVF_ADCINT2   0x2U   // ADC Interrupt 2 Overflow Flags
#define ADC_INTOVF_ADCINT3   0x4U   // ADC Interrupt 3 Overflow Flags
#define ADC_INTOVF_ADCINT4   0x8U   // ADC Interrupt 4 Overflow Flags

//*************************************************************************************************
//
// The following are defines for the bit fields in the ADCINTOVFCLR register
//
//*************************************************************************************************
#define ADC_INTOVFCLR_ADCINT1   0x1U   // ADC Interrupt 1 Overflow Clear Bits
#define ADC_INTOVFCLR_ADCINT2   0x2U   // ADC Interrupt 2 Overflow Clear Bits
#define ADC_INTOVFCLR_ADCINT3   0x4U   // ADC Interrupt 3 Overflow Clear Bits
#define ADC_INTOVFCLR_ADCINT4   0x8U   // ADC Interrupt 4 Overflow Clear Bits

//*************************************************************************************************
//
// The following are defines for the bit fields in the ADCINTSEL1N2 register
//
//*************************************************************************************************
#define ADC_INTSEL1N2_INT1SEL_S   0U
#define ADC_INTSEL1N2_INT1SEL_M   0x3FU     // ADCINT1 EOC Source Select
#define ADC_INTSEL1N2_INT1CONT    0x40U     // ADCINT1 Continue to Interrupt Mode
#define ADC_INTSEL1N2_INT1E       0x80U     // ADCINT1 Interrupt Enable
#define ADC_INTSEL1N2_INT2SEL_S   8U
#define ADC_INTSEL1N2_INT2SEL_M   0x3F00U   // ADCINT2 EOC Source Select
#define ADC_INTSEL1N2_INT2CONT    0x4000U   // ADCINT2 Continue to Interrupt Mode
#define ADC_INTSEL1N2_INT2E       0x8000U   // ADCINT2 Interrupt Enable

//*************************************************************************************************
//
// The following are defines for the bit fields in the ADCINTSEL3N4 register
//
//*************************************************************************************************
#define ADC_INTSEL3N4_INT3SEL_S   0U
#define ADC_INTSEL3N4_INT3SEL_M   0x3FU     // ADCINT3 EOC Source Select
#define ADC_INTSEL3N4_INT3CONT    0x40U     // ADCINT3 Continue to Interrupt Mode
#define ADC_INTSEL3N4_INT3E       0x80U     // ADCINT3 Interrupt Enable
#define ADC_INTSEL3N4_INT4SEL_S   8U
#define ADC_INTSEL3N4_INT4SEL_M   0x3F00U   // ADCINT4 EOC Source Select
#define ADC_INTSEL3N4_INT4CONT    0x4000U   // ADCINT4 Continue to Interrupt Mode
#define ADC_INTSEL3N4_INT4E       0x8000U   // ADCINT4 Interrupt Enable

//*************************************************************************************************
//
// The following are defines for the bit fields in the ADCSOCPRICTL register
//
//*************************************************************************************************
#define ADC_SOCPRICTL_SOCPRIORITY_S   0U
#define ADC_SOCPRICTL_SOCPRIORITY_M   0x3FU    // SOC Priority
#define ADC_SOCPRICTL_RRPOINTER_S     6U
#define ADC_SOCPRICTL_RRPOINTER_M     0xFC0U   // Round Robin Pointer

//*************************************************************************************************
//
// The following are defines for the bit fields in the ADCINTSOCSEL1 register
//
//*************************************************************************************************
#define ADC_INTSOCSEL1_SOC0_S    0U
#define ADC_INTSOCSEL1_SOC0_M    0x3U          // SOC0 ADC Interrupt Trigger Select
#define ADC_INTSOCSEL1_SOC1_S    2U
#define ADC_INTSOCSEL1_SOC1_M    0xCU          // SOC1 ADC Interrupt Trigger Select
#define ADC_INTSOCSEL1_SOC2_S    4U
#define ADC_INTSOCSEL1_SOC2_M    0x30U         // SOC2 ADC Interrupt Trigger Select
#define ADC_INTSOCSEL1_SOC3_S    6U
#define ADC_INTSOCSEL1_SOC3_M    0xC0U         // SOC3 ADC Interrupt Trigger Select
#define ADC_INTSOCSEL1_SOC4_S    8U
#define ADC_INTSOCSEL1_SOC4_M    0x300U        // SOC4 ADC Interrupt Trigger Select
#define ADC_INTSOCSEL1_SOC5_S    10U
#define ADC_INTSOCSEL1_SOC5_M    0xC00U        // SOC5 ADC Interrupt Trigger Select
#define ADC_INTSOCSEL1_SOC6_S    12U
#define ADC_INTSOCSEL1_SOC6_M    0x3000U       // SOC6 ADC Interrupt Trigger Select
#define ADC_INTSOCSEL1_SOC7_S    14U
#define ADC_INTSOCSEL1_SOC7_M    0xC000U       // SOC7 ADC Interrupt Trigger Select
#define ADC_INTSOCSEL1_SOC8_S    16U
#define ADC_INTSOCSEL1_SOC8_M    0x30000U      // SOC8 ADC Interrupt Trigger Select
#define ADC_INTSOCSEL1_SOC9_S    18U
#define ADC_INTSOCSEL1_SOC9_M    0xC0000U      // SOC9 ADC Interrupt Trigger Select
#define ADC_INTSOCSEL1_SOC10_S   20U
#define ADC_INTSOCSEL1_SOC10_M   0x300000U     // SOC10 ADC Interrupt Trigger Select
#define ADC_INTSOCSEL1_SOC11_S   22U
#define ADC_INTSOCSEL1_SOC11_M   0xC00000U     // SOC11 ADC Interrupt Trigger Select
#define ADC_INTSOCSEL1_SOC12_S   24U
#define ADC_INTSOCSEL1_SOC12_M   0x3000000U    // SOC12 ADC Interrupt Trigger Select
#define ADC_INTSOCSEL1_SOC13_S   26U
#define ADC_INTSOCSEL1_SOC13_M   0xC000000U    // SOC13 ADC Interrupt Trigger Select
#define ADC_INTSOCSEL1_SOC14_S   28U
#define ADC_INTSOCSEL1_SOC14_M   0x30000000U   // SOC14 ADC Interrupt Trigger Select
#define ADC_INTSOCSEL1_SOC15_S   30U
#define ADC_INTSOCSEL1_SOC15_M   0xC0000000U   // SOC15 ADC Interrupt Trigger Select

//*************************************************************************************************
//
// The following are defines for the bit fields in the ADCINTSOCSEL2 register
//
//*************************************************************************************************
#define ADC_INTSOCSEL2_SOC16_S   0U
#define ADC_INTSOCSEL2_SOC16_M   0x3U          // SOC16 ADC Interrupt Trigger Select
#define ADC_INTSOCSEL2_SOC17_S   2U
#define ADC_INTSOCSEL2_SOC17_M   0xCU          // SOC17 ADC Interrupt Trigger Select
#define ADC_INTSOCSEL2_SOC18_S   4U
#define ADC_INTSOCSEL2_SOC18_M   0x30U         // SOC18 ADC Interrupt Trigger Select
#define ADC_INTSOCSEL2_SOC19_S   6U
#define ADC_INTSOCSEL2_SOC19_M   0xC0U         // SOC19 ADC Interrupt Trigger Select
#define ADC_INTSOCSEL2_SOC20_S   8U
#define ADC_INTSOCSEL2_SOC20_M   0x300U        // SOC20 ADC Interrupt Trigger Select
#define ADC_INTSOCSEL2_SOC21_S   10U
#define ADC_INTSOCSEL2_SOC21_M   0xC00U        // SOC21 ADC Interrupt Trigger Select
#define ADC_INTSOCSEL2_SOC22_S   12U
#define ADC_INTSOCSEL2_SOC22_M   0x3000U       // SOC22 ADC Interrupt Trigger Select
#define ADC_INTSOCSEL2_SOC23_S   14U
#define ADC_INTSOCSEL2_SOC23_M   0xC000U       // SOC23 ADC Interrupt Trigger Select
#define ADC_INTSOCSEL2_SOC24_S   16U
#define ADC_INTSOCSEL2_SOC24_M   0x30000U      // SOC24 ADC Interrupt Trigger Select
#define ADC_INTSOCSEL2_SOC25_S   18U
#define ADC_INTSOCSEL2_SOC25_M   0xC0000U      // SOC25 ADC Interrupt Trigger Select
#define ADC_INTSOCSEL2_SOC26_S   20U
#define ADC_INTSOCSEL2_SOC26_M   0x300000U     // SOC26 ADC Interrupt Trigger Select
#define ADC_INTSOCSEL2_SOC27_S   22U
#define ADC_INTSOCSEL2_SOC27_M   0xC00000U     // SOC27 ADC Interrupt Trigger Select
#define ADC_INTSOCSEL2_SOC28_S   24U
#define ADC_INTSOCSEL2_SOC28_M   0x3000000U    // SOC28 ADC Interrupt Trigger Select
#define ADC_INTSOCSEL2_SOC29_S   26U
#define ADC_INTSOCSEL2_SOC29_M   0xC000000U    // SOC29 ADC Interrupt Trigger Select
#define ADC_INTSOCSEL2_SOC30_S   28U
#define ADC_INTSOCSEL2_SOC30_M   0x30000000U   // SOC30 ADC Interrupt Trigger Select
#define ADC_INTSOCSEL2_SOC31_S   30U
#define ADC_INTSOCSEL2_SOC31_M   0xC0000000U   // SOC31 ADC Interrupt Trigger Select

//*************************************************************************************************
//
// The following are defines for the bit fields in the ADCSOCFLG1 register
//
//*************************************************************************************************
#define ADC_SOCFLG1_SOC0    0x1U          // SOC0 Start of Conversion Flag
#define ADC_SOCFLG1_SOC1    0x2U          // SOC1 Start of Conversion Flag
#define ADC_SOCFLG1_SOC2    0x4U          // SOC2 Start of Conversion Flag
#define ADC_SOCFLG1_SOC3    0x8U          // SOC3 Start of Conversion Flag
#define ADC_SOCFLG1_SOC4    0x10U         // SOC4 Start of Conversion Flag
#define ADC_SOCFLG1_SOC5    0x20U         // SOC5 Start of Conversion Flag
#define ADC_SOCFLG1_SOC6    0x40U         // SOC6 Start of Conversion Flag
#define ADC_SOCFLG1_SOC7    0x80U         // SOC7 Start of Conversion Flag
#define ADC_SOCFLG1_SOC8    0x100U        // SOC8 Start of Conversion Flag
#define ADC_SOCFLG1_SOC9    0x200U        // SOC9 Start of Conversion Flag
#define ADC_SOCFLG1_SOC10   0x400U        // SOC10 Start of Conversion Flag
#define ADC_SOCFLG1_SOC11   0x800U        // SOC11 Start of Conversion Flag
#define ADC_SOCFLG1_SOC12   0x1000U       // SOC12 Start of Conversion Flag
#define ADC_SOCFLG1_SOC13   0x2000U       // SOC13 Start of Conversion Flag
#define ADC_SOCFLG1_SOC14   0x4000U       // SOC14 Start of Conversion Flag
#define ADC_SOCFLG1_SOC15   0x8000U       // SOC15 Start of Conversion Flag
#define ADC_SOCFLG1_SOC16   0x10000U      // SOC16 Start of Conversion Flag
#define ADC_SOCFLG1_SOC17   0x20000U      // SOC17 Start of Conversion Flag
#define ADC_SOCFLG1_SOC18   0x40000U      // SOC18 Start of Conversion Flag
#define ADC_SOCFLG1_SOC19   0x80000U      // SOC19 Start of Conversion Flag
#define ADC_SOCFLG1_SOC20   0x100000U     // SOC20 Start of Conversion Flag
#define ADC_SOCFLG1_SOC21   0x200000U     // SOC21 Start of Conversion Flag
#define ADC_SOCFLG1_SOC22   0x400000U     // SOC22 Start of Conversion Flag
#define ADC_SOCFLG1_SOC23   0x800000U     // SOC23 Start of Conversion Flag
#define ADC_SOCFLG1_SOC24   0x1000000U    // SOC24 Start of Conversion Flag
#define ADC_SOCFLG1_SOC25   0x2000000U    // SOC25 Start of Conversion Flag
#define ADC_SOCFLG1_SOC26   0x4000000U    // SOC26 Start of Conversion Flag
#define ADC_SOCFLG1_SOC27   0x8000000U    // SOC27 Start of Conversion Flag
#define ADC_SOCFLG1_SOC28   0x10000000U   // SOC28 Start of Conversion Flag
#define ADC_SOCFLG1_SOC29   0x20000000U   // SOC29 Start of Conversion Flag
#define ADC_SOCFLG1_SOC30   0x40000000U   // SOC30 Start of Conversion Flag
#define ADC_SOCFLG1_SOC31   0x80000000U   // SOC31 Start of Conversion Flag

//*************************************************************************************************
//
// The following are defines for the bit fields in the ADCSOCFRC1 register
//
//*************************************************************************************************
#define ADC_SOCFRC1_SOC0    0x1U          // SOC0 Force Start of Conversion Bit
#define ADC_SOCFRC1_SOC1    0x2U          // SOC1 Force Start of Conversion Bit
#define ADC_SOCFRC1_SOC2    0x4U          // SOC2 Force Start of Conversion Bit
#define ADC_SOCFRC1_SOC3    0x8U          // SOC3 Force Start of Conversion Bit
#define ADC_SOCFRC1_SOC4    0x10U         // SOC4 Force Start of Conversion Bit
#define ADC_SOCFRC1_SOC5    0x20U         // SOC5 Force Start of Conversion Bit
#define ADC_SOCFRC1_SOC6    0x40U         // SOC6 Force Start of Conversion Bit
#define ADC_SOCFRC1_SOC7    0x80U         // SOC7 Force Start of Conversion Bit
#define ADC_SOCFRC1_SOC8    0x100U        // SOC8 Force Start of Conversion Bit
#define ADC_SOCFRC1_SOC9    0x200U        // SOC9 Force Start of Conversion Bit
#define ADC_SOCFRC1_SOC10   0x400U        // SOC10 Force Start of Conversion Bit
#define ADC_SOCFRC1_SOC11   0x800U        // SOC11 Force Start of Conversion Bit
#define ADC_SOCFRC1_SOC12   0x1000U       // SOC12 Force Start of Conversion Bit
#define ADC_SOCFRC1_SOC13   0x2000U       // SOC13 Force Start of Conversion Bit
#define ADC_SOCFRC1_SOC14   0x4000U       // SOC14 Force Start of Conversion Bit
#define ADC_SOCFRC1_SOC15   0x8000U       // SOC15 Force Start of Conversion Bit
#define ADC_SOCFRC1_SOC16   0x10000U      // SOC16 Force Start of Conversion Bit
#define ADC_SOCFRC1_SOC17   0x20000U      // SOC17 Force Start of Conversion Bit
#define ADC_SOCFRC1_SOC18   0x40000U      // SOC18 Force Start of Conversion Bit
#define ADC_SOCFRC1_SOC19   0x80000U      // SOC19 Force Start of Conversion Bit
#define ADC_SOCFRC1_SOC20   0x100000U     // SOC20 Force Start of Conversion Bit
#define ADC_SOCFRC1_SOC21   0x200000U     // SOC21 Force Start of Conversion Bit
#define ADC_SOCFRC1_SOC22   0x400000U     // SOC22 Force Start of Conversion Bit
#define ADC_SOCFRC1_SOC23   0x800000U     // SOC23 Force Start of Conversion Bit
#define ADC_SOCFRC1_SOC24   0x1000000U    // SOC24 Force Start of Conversion Bit
#define ADC_SOCFRC1_SOC25   0x2000000U    // SOC25 Force Start of Conversion Bit
#define ADC_SOCFRC1_SOC26   0x4000000U    // SOC26 Force Start of Conversion Bit
#define ADC_SOCFRC1_SOC27   0x8000000U    // SOC27 Force Start of Conversion Bit
#define ADC_SOCFRC1_SOC28   0x10000000U   // SOC28 Force Start of Conversion Bit
#define ADC_SOCFRC1_SOC29   0x20000000U   // SOC29 Force Start of Conversion Bit
#define ADC_SOCFRC1_SOC30   0x40000000U   // SOC30 Force Start of Conversion Bit
#define ADC_SOCFRC1_SOC31   0x80000000U   // SOC31 Force Start of Conversion Bit

//*************************************************************************************************
//
// The following are defines for the bit fields in the ADCSOCOVF1 register
//
//*************************************************************************************************
#define ADC_SOCOVF1_SOC0    0x1U          // SOC0 Start of Conversion Overflow Flag
#define ADC_SOCOVF1_SOC1    0x2U          // SOC1 Start of Conversion Overflow Flag
#define ADC_SOCOVF1_SOC2    0x4U          // SOC2 Start of Conversion Overflow Flag
#define ADC_SOCOVF1_SOC3    0x8U          // SOC3 Start of Conversion Overflow Flag
#define ADC_SOCOVF1_SOC4    0x10U         // SOC4 Start of Conversion Overflow Flag
#define ADC_SOCOVF1_SOC5    0x20U         // SOC5 Start of Conversion Overflow Flag
#define ADC_SOCOVF1_SOC6    0x40U         // SOC6 Start of Conversion Overflow Flag
#define ADC_SOCOVF1_SOC7    0x80U         // SOC7 Start of Conversion Overflow Flag
#define ADC_SOCOVF1_SOC8    0x100U        // SOC8 Start of Conversion Overflow Flag
#define ADC_SOCOVF1_SOC9    0x200U        // SOC9 Start of Conversion Overflow Flag
#define ADC_SOCOVF1_SOC10   0x400U        // SOC10 Start of Conversion Overflow Flag
#define ADC_SOCOVF1_SOC11   0x800U        // SOC11 Start of Conversion Overflow Flag
#define ADC_SOCOVF1_SOC12   0x1000U       // SOC12 Start of Conversion Overflow Flag
#define ADC_SOCOVF1_SOC13   0x2000U       // SOC13 Start of Conversion Overflow Flag
#define ADC_SOCOVF1_SOC14   0x4000U       // SOC14 Start of Conversion Overflow Flag
#define ADC_SOCOVF1_SOC15   0x8000U       // SOC15 Start of Conversion Overflow Flag
#define ADC_SOCOVF1_SOC16   0x10000U      // SOC16 Start of Conversion Overflow Flag
#define ADC_SOCOVF1_SOC17   0x20000U      // SOC17 Start of Conversion Overflow Flag
#define ADC_SOCOVF1_SOC18   0x40000U      // SOC18 Start of Conversion Overflow Flag
#define ADC_SOCOVF1_SOC19   0x80000U      // SOC19 Start of Conversion Overflow Flag
#define ADC_SOCOVF1_SOC20   0x100000U     // SOC20 Start of Conversion Overflow Flag
#define ADC_SOCOVF1_SOC21   0x200000U     // SOC21 Start of Conversion Overflow Flag
#define ADC_SOCOVF1_SOC22   0x400000U     // SOC22 Start of Conversion Overflow Flag
#define ADC_SOCOVF1_SOC23   0x800000U     // SOC23 Start of Conversion Overflow Flag
#define ADC_SOCOVF1_SOC24   0x1000000U    // SOC24 Start of Conversion Overflow Flag
#define ADC_SOCOVF1_SOC25   0x2000000U    // SOC25 Start of Conversion Overflow Flag
#define ADC_SOCOVF1_SOC26   0x4000000U    // SOC26 Start of Conversion Overflow Flag
#define ADC_SOCOVF1_SOC27   0x8000000U    // SOC27 Start of Conversion Overflow Flag
#define ADC_SOCOVF1_SOC28   0x10000000U   // SOC28 Start of Conversion Overflow Flag
#define ADC_SOCOVF1_SOC29   0x20000000U   // SOC29 Start of Conversion Overflow Flag
#define ADC_SOCOVF1_SOC30   0x40000000U   // SOC30 Start of Conversion Overflow Flag
#define ADC_SOCOVF1_SOC31   0x80000000U   // SOC31 Start of Conversion Overflow Flag

