TexasInstruments/f29h85x-sdk/source/driverlib/inc/hw_adc.h
//*************************************************************************************************
//
// The following are defines for the bit fields in the ADCSOCOVFCLR1 register
//
//*************************************************************************************************
#define ADC_SOCOVFCLR1_SOC0    0x1U          // SOC0 Clear Start of Conversion Overflow Bit
#define ADC_SOCOVFCLR1_SOC1    0x2U          // SOC1 Clear Start of Conversion Overflow Bit
#define ADC_SOCOVFCLR1_SOC2    0x4U          // SOC2 Clear Start of Conversion Overflow Bit
#define ADC_SOCOVFCLR1_SOC3    0x8U          // SOC3 Clear Start of Conversion Overflow Bit
#define ADC_SOCOVFCLR1_SOC4    0x10U         // SOC4 Clear Start of Conversion Overflow Bit
#define ADC_SOCOVFCLR1_SOC5    0x20U         // SOC5 Clear Start of Conversion Overflow Bit
#define ADC_SOCOVFCLR1_SOC6    0x40U         // SOC6 Clear Start of Conversion Overflow Bit
#define ADC_SOCOVFCLR1_SOC7    0x80U         // SOC7 Clear Start of Conversion Overflow Bit
#define ADC_SOCOVFCLR1_SOC8    0x100U        // SOC8 Clear Start of Conversion Overflow Bit
#define ADC_SOCOVFCLR1_SOC9    0x200U        // SOC9 Clear Start of Conversion Overflow Bit
#define ADC_SOCOVFCLR1_SOC10   0x400U        // SOC10 Clear Start of Conversion Overflow Bit
#define ADC_SOCOVFCLR1_SOC11   0x800U        // SOC11 Clear Start of Conversion Overflow Bit
#define ADC_SOCOVFCLR1_SOC12   0x1000U       // SOC12 Clear Start of Conversion Overflow Bit
#define ADC_SOCOVFCLR1_SOC13   0x2000U       // SOC13 Clear Start of Conversion Overflow Bit
#define ADC_SOCOVFCLR1_SOC14   0x4000U       // SOC14 Clear Start of Conversion Overflow Bit
#define ADC_SOCOVFCLR1_SOC15   0x8000U       // SOC15 Clear Start of Conversion Overflow Bit
#define ADC_SOCOVFCLR1_SOC16   0x10000U      // SOC16 Clear Start of Conversion Overflow Bit
#define ADC_SOCOVFCLR1_SOC17   0x20000U      // SOC17 Clear Start of Conversion Overflow Bit
#define ADC_SOCOVFCLR1_SOC18   0x40000U      // SOC18 Clear Start of Conversion Overflow Bit
#define ADC_SOCOVFCLR1_SOC19   0x80000U      // SOC19 Clear Start of Conversion Overflow Bit
#define ADC_SOCOVFCLR1_SOC20   0x100000U     // SOC20 Clear Start of Conversion Overflow Bit
#define ADC_SOCOVFCLR1_SOC21   0x200000U     // SOC21 Clear Start of Conversion Overflow Bit
#define ADC_SOCOVFCLR1_SOC22   0x400000U     // SOC22 Clear Start of Conversion Overflow Bit
#define ADC_SOCOVFCLR1_SOC23   0x800000U     // SOC23 Clear Start of Conversion Overflow Bit
#define ADC_SOCOVFCLR1_SOC24   0x1000000U    // SOC24 Clear Start of Conversion Overflow Bit
#define ADC_SOCOVFCLR1_SOC25   0x2000000U    // SOC25 Clear Start of Conversion Overflow Bit
#define ADC_SOCOVFCLR1_SOC26   0x4000000U    // SOC26 Clear Start of Conversion Overflow Bit
#define ADC_SOCOVFCLR1_SOC27   0x8000000U    // SOC27 Clear Start of Conversion Overflow Bit
#define ADC_SOCOVFCLR1_SOC28   0x10000000U   // SOC28 Clear Start of Conversion Overflow Bit
#define ADC_SOCOVFCLR1_SOC29   0x20000000U   // SOC29 Clear Start of Conversion Overflow Bit
#define ADC_SOCOVFCLR1_SOC30   0x40000000U   // SOC30 Clear Start of Conversion Overflow Bit
#define ADC_SOCOVFCLR1_SOC31   0x80000000U   // SOC31 Clear Start of Conversion Overflow Bit

//*************************************************************************************************
//
// The following are defines for the bit fields in the ADCSOC0CTL register
//
//*************************************************************************************************
#define ADC_SOC0CTL_ACQPS_S      0U
#define ADC_SOC0CTL_ACQPS_M      0x1FFU        // SOC0 Acquisition Prescale
#define ADC_SOC0CTL_CHSEL_S      15U
#define ADC_SOC0CTL_CHSEL_M      0xF8000U      // SOC0 Channel Select
#define ADC_SOC0CTL_TRIGSEL_S    20U
#define ADC_SOC0CTL_TRIGSEL_M    0x7F00000U    // SOC0 Trigger Source Select
#define ADC_SOC0CTL_EXTCHSEL_S   28U
#define ADC_SOC0CTL_EXTCHSEL_M   0xF0000000U   // SOC0 External Channel Mux Select

//*************************************************************************************************
//
// The following are defines for the bit fields in the ADCSOC1CTL register
//
//*************************************************************************************************
#define ADC_SOC1CTL_ACQPS_S      0U
#define ADC_SOC1CTL_ACQPS_M      0x1FFU        // SOC1 Acquisition Prescale
#define ADC_SOC1CTL_CHSEL_S      15U
#define ADC_SOC1CTL_CHSEL_M      0xF8000U      // SOC1 Channel Select
#define ADC_SOC1CTL_TRIGSEL_S    20U
#define ADC_SOC1CTL_TRIGSEL_M    0x7F00000U    // SOC1 Trigger Source Select
#define ADC_SOC1CTL_EXTCHSEL_S   28U
#define ADC_SOC1CTL_EXTCHSEL_M   0xF0000000U   // SOC1 External Channel Mux Select

//*************************************************************************************************
//
// The following are defines for the bit fields in the ADCSOC2CTL register
//
//*************************************************************************************************
#define ADC_SOC2CTL_ACQPS_S      0U
#define ADC_SOC2CTL_ACQPS_M      0x1FFU        // SOC2 Acquisition Prescale
#define ADC_SOC2CTL_CHSEL_S      15U
#define ADC_SOC2CTL_CHSEL_M      0xF8000U      // SOC2 Channel Select
#define ADC_SOC2CTL_TRIGSEL_S    20U
#define ADC_SOC2CTL_TRIGSEL_M    0x7F00000U    // SOC2 Trigger Source Select
#define ADC_SOC2CTL_EXTCHSEL_S   28U
#define ADC_SOC2CTL_EXTCHSEL_M   0xF0000000U   // SOC2 External Channel Mux Select

//*************************************************************************************************
//
// The following are defines for the bit fields in the ADCSOC3CTL register
//
//*************************************************************************************************
#define ADC_SOC3CTL_ACQPS_S      0U
#define ADC_SOC3CTL_ACQPS_M      0x1FFU        // SOC3 Acquisition Prescale
#define ADC_SOC3CTL_CHSEL_S      15U
#define ADC_SOC3CTL_CHSEL_M      0xF8000U      // SOC3 Channel Select
#define ADC_SOC3CTL_TRIGSEL_S    20U
#define ADC_SOC3CTL_TRIGSEL_M    0x7F00000U    // SOC3 Trigger Source Select
#define ADC_SOC3CTL_EXTCHSEL_S   28U
#define ADC_SOC3CTL_EXTCHSEL_M   0xF0000000U   // SOC3 External Channel Mux Select

//*************************************************************************************************
//
// The following are defines for the bit fields in the ADCSOC4CTL register
//
//*************************************************************************************************
#define ADC_SOC4CTL_ACQPS_S      0U
#define ADC_SOC4CTL_ACQPS_M      0x1FFU        // SOC4 Acquisition Prescale
#define ADC_SOC4CTL_CHSEL_S      15U
#define ADC_SOC4CTL_CHSEL_M      0xF8000U      // SOC4 Channel Select
#define ADC_SOC4CTL_TRIGSEL_S    20U
#define ADC_SOC4CTL_TRIGSEL_M    0x7F00000U    // SOC4 Trigger Source Select
#define ADC_SOC4CTL_EXTCHSEL_S   28U
#define ADC_SOC4CTL_EXTCHSEL_M   0xF0000000U   // SOC4 External Channel Mux Select

//*************************************************************************************************
//
// The following are defines for the bit fields in the ADCSOC5CTL register
//
//*************************************************************************************************
#define ADC_SOC5CTL_ACQPS_S      0U
#define ADC_SOC5CTL_ACQPS_M      0x1FFU        // SOC5 Acquisition Prescale
#define ADC_SOC5CTL_CHSEL_S      15U
#define ADC_SOC5CTL_CHSEL_M      0xF8000U      // SOC5 Channel Select
#define ADC_SOC5CTL_TRIGSEL_S    20U
#define ADC_SOC5CTL_TRIGSEL_M    0x7F00000U    // SOC5 Trigger Source Select
#define ADC_SOC5CTL_EXTCHSEL_S   28U
#define ADC_SOC5CTL_EXTCHSEL_M   0xF0000000U   // SOC5 External Channel Mux Select

//*************************************************************************************************
//
// The following are defines for the bit fields in the ADCSOC6CTL register
//
//*************************************************************************************************
#define ADC_SOC6CTL_ACQPS_S      0U
#define ADC_SOC6CTL_ACQPS_M      0x1FFU        // SOC6 Acquisition Prescale
#define ADC_SOC6CTL_CHSEL_S      15U
#define ADC_SOC6CTL_CHSEL_M      0xF8000U      // SOC6 Channel Select
#define ADC_SOC6CTL_TRIGSEL_S    20U
#define ADC_SOC6CTL_TRIGSEL_M    0x7F00000U    // SOC6 Trigger Source Select
#define ADC_SOC6CTL_EXTCHSEL_S   28U
#define ADC_SOC6CTL_EXTCHSEL_M   0xF0000000U   // SOC6 External Channel Mux Select

//*************************************************************************************************
//
// The following are defines for the bit fields in the ADCSOC7CTL register
//
//*************************************************************************************************
#define ADC_SOC7CTL_ACQPS_S      0U
#define ADC_SOC7CTL_ACQPS_M      0x1FFU        // SOC7 Acquisition Prescale
#define ADC_SOC7CTL_CHSEL_S      15U
#define ADC_SOC7CTL_CHSEL_M      0xF8000U      // SOC7 Channel Select
#define ADC_SOC7CTL_TRIGSEL_S    20U
#define ADC_SOC7CTL_TRIGSEL_M    0x7F00000U    // SOC7 Trigger Source Select
#define ADC_SOC7CTL_EXTCHSEL_S   28U
#define ADC_SOC7CTL_EXTCHSEL_M   0xF0000000U   // SOC7 External Channel Mux Select

//*************************************************************************************************
//
// The following are defines for the bit fields in the ADCSOC8CTL register
//
//*************************************************************************************************
#define ADC_SOC8CTL_ACQPS_S      0U
#define ADC_SOC8CTL_ACQPS_M      0x1FFU        // SOC8 Acquisition Prescale
#define ADC_SOC8CTL_CHSEL_S      15U
#define ADC_SOC8CTL_CHSEL_M      0xF8000U      // SOC8 Channel Select
#define ADC_SOC8CTL_TRIGSEL_S    20U
#define ADC_SOC8CTL_TRIGSEL_M    0x7F00000U    // SOC8 Trigger Source Select
#define ADC_SOC8CTL_EXTCHSEL_S   28U
#define ADC_SOC8CTL_EXTCHSEL_M   0xF0000000U   // SOC8 External Channel Mux Select

//*************************************************************************************************
//
// The following are defines for the bit fields in the ADCSOC9CTL register
//
//*************************************************************************************************
#define ADC_SOC9CTL_ACQPS_S      0U
#define ADC_SOC9CTL_ACQPS_M      0x1FFU        // SOC9 Acquisition Prescale
#define ADC_SOC9CTL_CHSEL_S      15U
#define ADC_SOC9CTL_CHSEL_M      0xF8000U      // SOC9 Channel Select
#define ADC_SOC9CTL_TRIGSEL_S    20U
#define ADC_SOC9CTL_TRIGSEL_M    0x7F00000U    // SOC9 Trigger Source Select
#define ADC_SOC9CTL_EXTCHSEL_S   28U
#define ADC_SOC9CTL_EXTCHSEL_M   0xF0000000U   // SOC9 External Channel Mux Select

//*************************************************************************************************
//
// The following are defines for the bit fields in the ADCSOC10CTL register
//
//*************************************************************************************************
#define ADC_SOC10CTL_ACQPS_S      0U
#define ADC_SOC10CTL_ACQPS_M      0x1FFU        // SOC10 Acquisition Prescale
#define ADC_SOC10CTL_CHSEL_S      15U
#define ADC_SOC10CTL_CHSEL_M      0xF8000U      // SOC10 Channel Select
#define ADC_SOC10CTL_TRIGSEL_S    20U
#define ADC_SOC10CTL_TRIGSEL_M    0x7F00000U    // SOC10 Trigger Source Select
#define ADC_SOC10CTL_EXTCHSEL_S   28U
#define ADC_SOC10CTL_EXTCHSEL_M   0xF0000000U   // SOC10 External Channel Mux Select

//*************************************************************************************************
//
// The following are defines for the bit fields in the ADCSOC11CTL register
//
//*************************************************************************************************
#define ADC_SOC11CTL_ACQPS_S      0U
#define ADC_SOC11CTL_ACQPS_M      0x1FFU        // SOC11 Acquisition Prescale
#define ADC_SOC11CTL_CHSEL_S      15U
#define ADC_SOC11CTL_CHSEL_M      0xF8000U      // SOC11 Channel Select
#define ADC_SOC11CTL_TRIGSEL_S    20U
#define ADC_SOC11CTL_TRIGSEL_M    0x7F00000U    // SOC11 Trigger Source Select
#define ADC_SOC11CTL_EXTCHSEL_S   28U
#define ADC_SOC11CTL_EXTCHSEL_M   0xF0000000U   // SOC11 External Channel Mux Select

//*************************************************************************************************
//
// The following are defines for the bit fields in the ADCSOC12CTL register
//
//*************************************************************************************************
#define ADC_SOC12CTL_ACQPS_S      0U
#define ADC_SOC12CTL_ACQPS_M      0x1FFU        // SOC12 Acquisition Prescale
#define ADC_SOC12CTL_CHSEL_S      15U
#define ADC_SOC12CTL_CHSEL_M      0xF8000U      // SOC12 Channel Select
#define ADC_SOC12CTL_TRIGSEL_S    20U
#define ADC_SOC12CTL_TRIGSEL_M    0x7F00000U    // SOC12 Trigger Source Select
#define ADC_SOC12CTL_EXTCHSEL_S   28U
#define ADC_SOC12CTL_EXTCHSEL_M   0xF0000000U   // SOC12 External Channel Mux Select

//*************************************************************************************************
//
// The following are defines for the bit fields in the ADCSOC13CTL register
//
//*************************************************************************************************
#define ADC_SOC13CTL_ACQPS_S      0U
#define ADC_SOC13CTL_ACQPS_M      0x1FFU        // SOC13 Acquisition Prescale
#define ADC_SOC13CTL_CHSEL_S      15U
#define ADC_SOC13CTL_CHSEL_M      0xF8000U      // SOC13 Channel Select
#define ADC_SOC13CTL_TRIGSEL_S    20U
#define ADC_SOC13CTL_TRIGSEL_M    0x7F00000U    // SOC13 Trigger Source Select
#define ADC_SOC13CTL_EXTCHSEL_S   28U
#define ADC_SOC13CTL_EXTCHSEL_M   0xF0000000U   // SOC13 External Channel Mux Select

//*************************************************************************************************
//
// The following are defines for the bit fields in the ADCSOC14CTL register
//
//*************************************************************************************************
#define ADC_SOC14CTL_ACQPS_S      0U
#define ADC_SOC14CTL_ACQPS_M      0x1FFU        // SOC14 Acquisition Prescale
#define ADC_SOC14CTL_CHSEL_S      15U
#define ADC_SOC14CTL_CHSEL_M      0xF8000U      // SOC14 Channel Select
#define ADC_SOC14CTL_TRIGSEL_S    20U
#define ADC_SOC14CTL_TRIGSEL_M    0x7F00000U    // SOC14 Trigger Source Select
#define ADC_SOC14CTL_EXTCHSEL_S   28U
#define ADC_SOC14CTL_EXTCHSEL_M   0xF0000000U   // SOC14 External Channel Mux Select

//*************************************************************************************************
//
// The following are defines for the bit fields in the ADCSOC15CTL register
//
//*************************************************************************************************
#define ADC_SOC15CTL_ACQPS_S      0U
#define ADC_SOC15CTL_ACQPS_M      0x1FFU        // SOC15 Acquisition Prescale
#define ADC_SOC15CTL_CHSEL_S      15U
#define ADC_SOC15CTL_CHSEL_M      0xF8000U      // SOC15 Channel Select
#define ADC_SOC15CTL_TRIGSEL_S    20U
#define ADC_SOC15CTL_TRIGSEL_M    0x7F00000U    // SOC15 Trigger Source Select
#define ADC_SOC15CTL_EXTCHSEL_S   28U
#define ADC_SOC15CTL_EXTCHSEL_M   0xF0000000U   // SOC15 External Channel Mux Select

//*************************************************************************************************
//
// The following are defines for the bit fields in the ADCSOC16CTL register
//
//*************************************************************************************************
#define ADC_SOC16CTL_ACQPS_S      0U
#define ADC_SOC16CTL_ACQPS_M      0x1FFU        // SOC16 Acquisition Prescale
#define ADC_SOC16CTL_CHSEL_S      15U
#define ADC_SOC16CTL_CHSEL_M      0xF8000U      // SOC16 Channel Select
#define ADC_SOC16CTL_TRIGSEL_S    20U
#define ADC_SOC16CTL_TRIGSEL_M    0x7F00000U    // SOC16 Trigger Source Select
#define ADC_SOC16CTL_EXTCHSEL_S   28U
#define ADC_SOC16CTL_EXTCHSEL_M   0xF0000000U   // SOC16 External Channel Mux Select

//*************************************************************************************************
//
// The following are defines for the bit fields in the ADCSOC17CTL register
//
//*************************************************************************************************
#define ADC_SOC17CTL_ACQPS_S      0U
#define ADC_SOC17CTL_ACQPS_M      0x1FFU        // SOC17 Acquisition Prescale
#define ADC_SOC17CTL_CHSEL_S      15U
#define ADC_SOC17CTL_CHSEL_M      0xF8000U      // SOC17 Channel Select
#define ADC_SOC17CTL_TRIGSEL_S    20U
#define ADC_SOC17CTL_TRIGSEL_M    0x7F00000U    // SOC17 Trigger Source Select
#define ADC_SOC17CTL_EXTCHSEL_S   28U
#define ADC_SOC17CTL_EXTCHSEL_M   0xF0000000U   // SOC17 External Channel Mux Select

//*************************************************************************************************
//
// The following are defines for the bit fields in the ADCSOC18CTL register
//
//*************************************************************************************************
#define ADC_SOC18CTL_ACQPS_S      0U
#define ADC_SOC18CTL_ACQPS_M      0x1FFU        // SOC18 Acquisition Prescale
#define ADC_SOC18CTL_CHSEL_S      15U
#define ADC_SOC18CTL_CHSEL_M      0xF8000U      // SOC18 Channel Select
#define ADC_SOC18CTL_TRIGSEL_S    20U
#define ADC_SOC18CTL_TRIGSEL_M    0x7F00000U    // SOC18 Trigger Source Select
#define ADC_SOC18CTL_EXTCHSEL_S   28U
#define ADC_SOC18CTL_EXTCHSEL_M   0xF0000000U   // SOC18 External Channel Mux Select

//*************************************************************************************************
//
// The following are defines for the bit fields in the ADCSOC19CTL register
//
//*************************************************************************************************
#define ADC_SOC19CTL_ACQPS_S      0U
#define ADC_SOC19CTL_ACQPS_M      0x1FFU        // SOC19 Acquisition Prescale
#define ADC_SOC19CTL_CHSEL_S      15U
#define ADC_SOC19CTL_CHSEL_M      0xF8000U      // SOC19 Channel Select
#define ADC_SOC19CTL_TRIGSEL_S    20U
#define ADC_SOC19CTL_TRIGSEL_M    0x7F00000U    // SOC19 Trigger Source Select
#define ADC_SOC19CTL_EXTCHSEL_S   28U
#define ADC_SOC19CTL_EXTCHSEL_M   0xF0000000U   // SOC19 External Channel Mux Select

//*************************************************************************************************
//
// The following are defines for the bit fields in the ADCSOC20CTL register
//
//*************************************************************************************************
#define ADC_SOC20CTL_ACQPS_S      0U
#define ADC_SOC20CTL_ACQPS_M      0x1FFU        // SOC20 Acquisition Prescale
#define ADC_SOC20CTL_CHSEL_S      15U
#define ADC_SOC20CTL_CHSEL_M      0xF8000U      // SOC20 Channel Select
#define ADC_SOC20CTL_TRIGSEL_S    20U
#define ADC_SOC20CTL_TRIGSEL_M    0x7F00000U    // SOC20 Trigger Source Select
#define ADC_SOC20CTL_EXTCHSEL_S   28U
#define ADC_SOC20CTL_EXTCHSEL_M   0xF0000000U   // SOC20 External Channel Mux Select

//*************************************************************************************************
//
// The following are defines for the bit fields in the ADCSOC21CTL register
//
//*************************************************************************************************
#define ADC_SOC21CTL_ACQPS_S      0U
#define ADC_SOC21CTL_ACQPS_M      0x1FFU        // SOC21 Acquisition Prescale
#define ADC_SOC21CTL_CHSEL_S      15U
#define ADC_SOC21CTL_CHSEL_M      0xF8000U      // SOC21 Channel Select
#define ADC_SOC21CTL_TRIGSEL_S    20U
#define ADC_SOC21CTL_TRIGSEL_M    0x7F00000U    // SOC21 Trigger Source Select
#define ADC_SOC21CTL_EXTCHSEL_S   28U
#define ADC_SOC21CTL_EXTCHSEL_M   0xF0000000U   // SOC21 External Channel Mux Select

//*************************************************************************************************
//
// The following are defines for the bit fields in the ADCSOC22CTL register
//
//*************************************************************************************************
#define ADC_SOC22CTL_ACQPS_S      0U
#define ADC_SOC22CTL_ACQPS_M      0x1FFU        // SOC22 Acquisition Prescale
#define ADC_SOC22CTL_CHSEL_S      15U
#define ADC_SOC22CTL_CHSEL_M      0xF8000U      // SOC22 Channel Select
#define ADC_SOC22CTL_TRIGSEL_S    20U
#define ADC_SOC22CTL_TRIGSEL_M    0x7F00000U    // SOC22 Trigger Source Select
#define ADC_SOC22CTL_EXTCHSEL_S   28U
#define ADC_SOC22CTL_EXTCHSEL_M   0xF0000000U   // SOC22 External Channel Mux Select

//*************************************************************************************************
//
// The following are defines for the bit fields in the ADCSOC23CTL register
//
//*************************************************************************************************
#define ADC_SOC23CTL_ACQPS_S      0U
#define ADC_SOC23CTL_ACQPS_M      0x1FFU        // SOC23 Acquisition Prescale
#define ADC_SOC23CTL_CHSEL_S      15U
#define ADC_SOC23CTL_CHSEL_M      0xF8000U      // SOC23 Channel Select
#define ADC_SOC23CTL_TRIGSEL_S    20U
#define ADC_SOC23CTL_TRIGSEL_M    0x7F00000U    // SOC23 Trigger Source Select
#define ADC_SOC23CTL_EXTCHSEL_S   28U
#define ADC_SOC23CTL_EXTCHSEL_M   0xF0000000U   // SOC23 External Channel Mux Select

//*************************************************************************************************
//
// The following are defines for the bit fields in the ADCSOC24CTL register
//
//*************************************************************************************************
#define ADC_SOC24CTL_ACQPS_S      0U
#define ADC_SOC24CTL_ACQPS_M      0x1FFU        // SOC24 Acquisition Prescale
#define ADC_SOC24CTL_CHSEL_S      15U
#define ADC_SOC24CTL_CHSEL_M      0xF8000U      // SOC24 Channel Select
#define ADC_SOC24CTL_TRIGSEL_S    20U
#define ADC_SOC24CTL_TRIGSEL_M    0x7F00000U    // SOC24 Trigger Source Select
#define ADC_SOC24CTL_EXTCHSEL_S   28U
#define ADC_SOC24CTL_EXTCHSEL_M   0xF0000000U   // SOC24 External Channel Mux Select

//*************************************************************************************************
//
// The following are defines for the bit fields in the ADCSOC25CTL register
//
//*************************************************************************************************
#define ADC_SOC25CTL_ACQPS_S      0U
#define ADC_SOC25CTL_ACQPS_M      0x1FFU        // SOC25 Acquisition Prescale
#define ADC_SOC25CTL_CHSEL_S      15U
#define ADC_SOC25CTL_CHSEL_M      0xF8000U      // SOC25 Channel Select
#define ADC_SOC25CTL_TRIGSEL_S    20U
#define ADC_SOC25CTL_TRIGSEL_M    0x7F00000U    // SOC25 Trigger Source Select
#define ADC_SOC25CTL_EXTCHSEL_S   28U
#define ADC_SOC25CTL_EXTCHSEL_M   0xF0000000U   // SOC25 External Channel Mux Select

//*************************************************************************************************
//
// The following are defines for the bit fields in the ADCSOC26CTL register
//
//*************************************************************************************************
#define ADC_SOC26CTL_ACQPS_S      0U
#define ADC_SOC26CTL_ACQPS_M      0x1FFU        // SOC26 Acquisition Prescale
#define ADC_SOC26CTL_CHSEL_S      15U
#define ADC_SOC26CTL_CHSEL_M      0xF8000U      // SOC26 Channel Select
#define ADC_SOC26CTL_TRIGSEL_S    20U
#define ADC_SOC26CTL_TRIGSEL_M    0x7F00000U    // SOC26 Trigger Source Select
#define ADC_SOC26CTL_EXTCHSEL_S   28U
#define ADC_SOC26CTL_EXTCHSEL_M   0xF0000000U   // SOC26 External Channel Mux Select

