TexasInstruments/f29h85x-sdk/source/driverlib/inc/hw_adc.h
//*************************************************************************************************
//
// The following are defines for the bit fields in the ADCSOC27CTL register
//
//*************************************************************************************************
#define ADC_SOC27CTL_ACQPS_S      0U
#define ADC_SOC27CTL_ACQPS_M      0x1FFU        // SOC27 Acquisition Prescale
#define ADC_SOC27CTL_CHSEL_S      15U
#define ADC_SOC27CTL_CHSEL_M      0xF8000U      // SOC27 Channel Select
#define ADC_SOC27CTL_TRIGSEL_S    20U
#define ADC_SOC27CTL_TRIGSEL_M    0x7F00000U    // SOC27 Trigger Source Select
#define ADC_SOC27CTL_EXTCHSEL_S   28U
#define ADC_SOC27CTL_EXTCHSEL_M   0xF0000000U   // SOC27 External Channel Mux Select

//*************************************************************************************************
//
// The following are defines for the bit fields in the ADCSOC28CTL register
//
//*************************************************************************************************
#define ADC_SOC28CTL_ACQPS_S      0U
#define ADC_SOC28CTL_ACQPS_M      0x1FFU        // SOC28 Acquisition Prescale
#define ADC_SOC28CTL_CHSEL_S      15U
#define ADC_SOC28CTL_CHSEL_M      0xF8000U      // SOC28 Channel Select
#define ADC_SOC28CTL_TRIGSEL_S    20U
#define ADC_SOC28CTL_TRIGSEL_M    0x7F00000U    // SOC28 Trigger Source Select
#define ADC_SOC28CTL_EXTCHSEL_S   28U
#define ADC_SOC28CTL_EXTCHSEL_M   0xF0000000U   // SOC28 External Channel Mux Select

//*************************************************************************************************
//
// The following are defines for the bit fields in the ADCSOC29CTL register
//
//*************************************************************************************************
#define ADC_SOC29CTL_ACQPS_S      0U
#define ADC_SOC29CTL_ACQPS_M      0x1FFU        // SOC29 Acquisition Prescale
#define ADC_SOC29CTL_CHSEL_S      15U
#define ADC_SOC29CTL_CHSEL_M      0xF8000U      // SOC29 Channel Select
#define ADC_SOC29CTL_TRIGSEL_S    20U
#define ADC_SOC29CTL_TRIGSEL_M    0x7F00000U    // SOC29 Trigger Source Select
#define ADC_SOC29CTL_EXTCHSEL_S   28U
#define ADC_SOC29CTL_EXTCHSEL_M   0xF0000000U   // SOC29 External Channel Mux Select

//*************************************************************************************************
//
// The following are defines for the bit fields in the ADCSOC30CTL register
//
//*************************************************************************************************
#define ADC_SOC30CTL_ACQPS_S      0U
#define ADC_SOC30CTL_ACQPS_M      0x1FFU        // SOC30 Acquisition Prescale
#define ADC_SOC30CTL_CHSEL_S      15U
#define ADC_SOC30CTL_CHSEL_M      0xF8000U      // SOC30 Channel Select
#define ADC_SOC30CTL_TRIGSEL_S    20U
#define ADC_SOC30CTL_TRIGSEL_M    0x7F00000U    // SOC30 Trigger Source Select
#define ADC_SOC30CTL_EXTCHSEL_S   28U
#define ADC_SOC30CTL_EXTCHSEL_M   0xF0000000U   // SOC30 External Channel Mux Select

//*************************************************************************************************
//
// The following are defines for the bit fields in the ADCSOC31CTL register
//
//*************************************************************************************************
#define ADC_SOC31CTL_ACQPS_S      0U
#define ADC_SOC31CTL_ACQPS_M      0x1FFU        // SOC31 Acquisition Prescale
#define ADC_SOC31CTL_CHSEL_S      15U
#define ADC_SOC31CTL_CHSEL_M      0xF8000U      // SOC31 Channel Select
#define ADC_SOC31CTL_TRIGSEL_S    20U
#define ADC_SOC31CTL_TRIGSEL_M    0x7F00000U    // SOC31 Trigger Source Select
#define ADC_SOC31CTL_EXTCHSEL_S   28U
#define ADC_SOC31CTL_EXTCHSEL_M   0xF0000000U   // SOC31 External Channel Mux Select

//*************************************************************************************************
//
// The following are defines for the bit fields in the ADCEVTSTAT register
//
//*************************************************************************************************
#define ADC_EVTSTAT_PPB1TRIPHI   0x1U      // Post Processing Block 1 Trip High Flag
#define ADC_EVTSTAT_PPB1TRIPLO   0x2U      // Post Processing Block 1 Trip Low Flag
#define ADC_EVTSTAT_PPB1ZERO     0x4U      // Post Processing Block 1 Zero Crossing Flag
#define ADC_EVTSTAT_PPB2TRIPHI   0x10U     // Post Processing Block 2 Trip High Flag
#define ADC_EVTSTAT_PPB2TRIPLO   0x20U     // Post Processing Block 2 Trip Low Flag
#define ADC_EVTSTAT_PPB2ZERO     0x40U     // Post Processing Block 2 Zero Crossing Flag
#define ADC_EVTSTAT_PPB3TRIPHI   0x100U    // Post Processing Block 3 Trip High Flag
#define ADC_EVTSTAT_PPB3TRIPLO   0x200U    // Post Processing Block 3 Trip Low Flag
#define ADC_EVTSTAT_PPB3ZERO     0x400U    // Post Processing Block 3 Zero Crossing Flag
#define ADC_EVTSTAT_PPB4TRIPHI   0x1000U   // Post Processing Block 4 Trip High Flag
#define ADC_EVTSTAT_PPB4TRIPLO   0x2000U   // Post Processing Block 4 Trip Low Flag
#define ADC_EVTSTAT_PPB4ZERO     0x4000U   // Post Processing Block 4 Zero Crossing Flag

//*************************************************************************************************
//
// The following are defines for the bit fields in the ADCEVTCLR register
//
//*************************************************************************************************
#define ADC_EVTCLR_PPB1TRIPHI   0x1U      // Post Processing Block 1 Trip High Clear
#define ADC_EVTCLR_PPB1TRIPLO   0x2U      // Post Processing Block 1 Trip Low Clear
#define ADC_EVTCLR_PPB1ZERO     0x4U      // Post Processing Block 1 Zero Crossing Clear
#define ADC_EVTCLR_PPB2TRIPHI   0x10U     // Post Processing Block 2 Trip High Clear
#define ADC_EVTCLR_PPB2TRIPLO   0x20U     // Post Processing Block 2 Trip Low Clear
#define ADC_EVTCLR_PPB2ZERO     0x40U     // Post Processing Block 2 Zero Crossing Clear
#define ADC_EVTCLR_PPB3TRIPHI   0x100U    // Post Processing Block 3 Trip High Clear
#define ADC_EVTCLR_PPB3TRIPLO   0x200U    // Post Processing Block 3 Trip Low Clear
#define ADC_EVTCLR_PPB3ZERO     0x400U    // Post Processing Block 3 Zero Crossing Clear
#define ADC_EVTCLR_PPB4TRIPHI   0x1000U   // Post Processing Block 4 Trip High Clear
#define ADC_EVTCLR_PPB4TRIPLO   0x2000U   // Post Processing Block 4 Trip Low Clear
#define ADC_EVTCLR_PPB4ZERO     0x4000U   // Post Processing Block 4 Zero Crossing Clear

//*************************************************************************************************
//
// The following are defines for the bit fields in the ADCEVTSEL register
//
//*************************************************************************************************
#define ADC_EVTSEL_PPB1TRIPHI   0x1U      // Post Processing Block 1 Trip High Event Enable
#define ADC_EVTSEL_PPB1TRIPLO   0x2U      // Post Processing Block 1 Trip Low Event Enable
#define ADC_EVTSEL_PPB1ZERO     0x4U      // Post Processing Block 1 Zero Crossing Event Enable
#define ADC_EVTSEL_PPB2TRIPHI   0x10U     // Post Processing Block 2 Trip High Event Enable
#define ADC_EVTSEL_PPB2TRIPLO   0x20U     // Post Processing Block 2 Trip Low Event Enable
#define ADC_EVTSEL_PPB2ZERO     0x40U     // Post Processing Block 2 Zero Crossing Event Enable
#define ADC_EVTSEL_PPB3TRIPHI   0x100U    // Post Processing Block 3 Trip High Event Enable
#define ADC_EVTSEL_PPB3TRIPLO   0x200U    // Post Processing Block 3 Trip Low Event Enable
#define ADC_EVTSEL_PPB3ZERO     0x400U    // Post Processing Block 3 Zero Crossing Event Enable
#define ADC_EVTSEL_PPB4TRIPHI   0x1000U   // Post Processing Block 4 Trip High Event Enable
#define ADC_EVTSEL_PPB4TRIPLO   0x2000U   // Post Processing Block 4 Trip Low Event Enable
#define ADC_EVTSEL_PPB4ZERO     0x4000U   // Post Processing Block 4 Zero Crossing Event Enable

//*************************************************************************************************
//
// The following are defines for the bit fields in the ADCEVTINTSEL register
//
//*************************************************************************************************
#define ADC_EVTINTSEL_PPB1TRIPHI   0x1U      // Post Processing Block 1 Trip High Interrupt Enable
#define ADC_EVTINTSEL_PPB1TRIPLO   0x2U      // Post Processing Block 1 Trip Low Interrupt Enable
#define ADC_EVTINTSEL_PPB1ZERO     0x4U      // Post Processing Block 1 Zero Crossing Interrupt
                                             // Enable
#define ADC_EVTINTSEL_PPB2TRIPHI   0x10U     // Post Processing Block 2 Trip High Interrupt Enable
#define ADC_EVTINTSEL_PPB2TRIPLO   0x20U     // Post Processing Block 2 Trip Low Interrupt Enable
#define ADC_EVTINTSEL_PPB2ZERO     0x40U     // Post Processing Block 2 Zero Crossing Interrupt
                                             // Enable
#define ADC_EVTINTSEL_PPB3TRIPHI   0x100U    // Post Processing Block 3 Trip High Interrupt Enable
#define ADC_EVTINTSEL_PPB3TRIPLO   0x200U    // Post Processing Block 3 Trip Low Interrupt Enable
#define ADC_EVTINTSEL_PPB3ZERO     0x400U    // Post Processing Block 3 Zero Crossing Interrupt
                                             // Enable
#define ADC_EVTINTSEL_PPB4TRIPHI   0x1000U   // Post Processing Block 4 Trip High Interrupt Enable
#define ADC_EVTINTSEL_PPB4TRIPLO   0x2000U   // Post Processing Block 4 Trip Low Interrupt Enable
#define ADC_EVTINTSEL_PPB4ZERO     0x4000U   // Post Processing Block 4 Zero Crossing Interrupt
                                             // Enable

//*************************************************************************************************
//
// The following are defines for the bit fields in the ADCOSDETECT register
//
//*************************************************************************************************
#define ADC_OSDETECT_DETECTCFG_S   0U
#define ADC_OSDETECT_DETECTCFG_M   0x7U   // ADC Opens and Shorts Detect Configuration

//*************************************************************************************************
//
// The following are defines for the bit fields in the ADCCOUNTER register
//
//*************************************************************************************************
#define ADC_COUNTER_FREECOUNT_S   0U
#define ADC_COUNTER_FREECOUNT_M   0xFFFU   // ADC Free Running Counter Value

//*************************************************************************************************
//
// The following are defines for the bit fields in the ADCREV register
//
//*************************************************************************************************
#define ADC_REV_TYPE_S   0U
#define ADC_REV_TYPE_M   0xFFU     // ADC Type
#define ADC_REV_REV_S    8U
#define ADC_REV_REV_M    0xFF00U   // ADC Revision

//*************************************************************************************************
//
// The following are defines for the bit fields in the ADCOFFTRIM register
//
//*************************************************************************************************
#define ADC_OFFTRIM_OFFTRIM_S           0U
#define ADC_OFFTRIM_OFFTRIM_M           0xFFU     // ADC Offset Trim 12B SE Even
#define ADC_OFFTRIM_OFFTRIM12BSEODD_S   8U
#define ADC_OFFTRIM_OFFTRIM12BSEODD_M   0xFF00U   // ADC Offset Trim 12B SE Odd

//*************************************************************************************************
//
// The following are defines for the bit fields in the ADCOFFTRIM2 register
//
//*************************************************************************************************
#define ADC_OFFTRIM2_OFFTRIM16BSEEVEN_S   0U
#define ADC_OFFTRIM2_OFFTRIM16BSEEVEN_M   0xFFU     // ADC Offset Trim 16B SE Even
#define ADC_OFFTRIM2_OFFTRIM16BSEODD_S    8U
#define ADC_OFFTRIM2_OFFTRIM16BSEODD_M    0xFF00U   // ADC Offset Trim 16B SE Odd

//*************************************************************************************************
//
// The following are defines for the bit fields in the ADCOFFTRIM3 register
//
//*************************************************************************************************
#define ADC_OFFTRIM3_OFFTRIM12BDE_S   0U
#define ADC_OFFTRIM3_OFFTRIM12BDE_M   0xFFU     // ADC Offset Trim 12B DE
#define ADC_OFFTRIM3_OFFTRIM16BDE_S   8U
#define ADC_OFFTRIM3_OFFTRIM16BDE_M   0xFF00U   // ADC Offset Trim 16B DE

//*************************************************************************************************
//
// The following are defines for the bit fields in the ADCPPB1CONFIG register
//
//*************************************************************************************************
#define ADC_PPB1CONFIG_CONFIG_S     0U
#define ADC_PPB1CONFIG_CONFIG_M     0x1FU    // ADC Post Processing Block 1 Configuration
#define ADC_PPB1CONFIG_CBCEN        0x20U    // Cycle By Cycle Enable
#define ADC_PPB1CONFIG_ABSEN        0x40U    // ADC Post Processing Block 1 Absolute Enable
#define ADC_PPB1CONFIG_TWOSCOMPEN   0x80U    // ADC Post Processing Block 1 Two's Complement Enable
#define ADC_PPB1CONFIG_DELTAEN      0x100U   // ADC Post Processing Block 1 Last Sample Delta
                                             // Enable

//*************************************************************************************************
//
// The following are defines for the bit fields in the ADCPPB1STAMP register
//
//*************************************************************************************************
#define ADC_PPB1STAMP_DLYSTAMP_S   0U
#define ADC_PPB1STAMP_DLYSTAMP_M   0xFFFU   // ADC Post Processing Block 1 Delay Time Stamp

//*************************************************************************************************
//
// The following are defines for the bit fields in the ADCPPB1OFFCAL register
//
//*************************************************************************************************
#define ADC_PPB1OFFCAL_OFFCAL_S   0U
#define ADC_PPB1OFFCAL_OFFCAL_M   0x3FFU   // ADC Post Processing Block Offset Correction

//*************************************************************************************************
//
// The following are defines for the bit fields in the ADCPPB1TRIPHI register
//
//*************************************************************************************************
#define ADC_PPB1TRIPHI_LIMITHI_S   0U
#define ADC_PPB1TRIPHI_LIMITHI_M   0xFFFFFFU   // ADC Post Processing Block 1 Trip High Limit

//*************************************************************************************************
//
// The following are defines for the bit fields in the ADCPPB1TRIPLO register
//
//*************************************************************************************************
#define ADC_PPB1TRIPLO_LIMITLO_S    0U
#define ADC_PPB1TRIPLO_LIMITLO_M    0xFFFFU       // ADC Post Processing Block 1 Trip Low Limit
#define ADC_PPB1TRIPLO_LSIGN        0x10000U      // Low Limit Sign Bit
#define ADC_PPB1TRIPLO_LIMITLO2EN   0x80000U      // Extended Low Limit 2 Enable
#define ADC_PPB1TRIPLO_REQSTAMP_S   20U
#define ADC_PPB1TRIPLO_REQSTAMP_M   0xFFF00000U   // ADC Post Processing Block 1 Request Time Stamp

//*************************************************************************************************
//
// The following are defines for the bit fields in the ADCPPBTRIP1FILCTL register
//
//*************************************************************************************************
#define ADC_PPBTRIP1FILCTL_FILTHIEN    0x1U      // ADCPPB1 TRIPHI Filter Enable
#define ADC_PPBTRIP1FILCTL_FILTLOEN    0x2U      // ADCPPB1 TRIPLO Filter Enable
#define ADC_PPBTRIP1FILCTL_SAMPWIN_S   3U
#define ADC_PPBTRIP1FILCTL_SAMPWIN_M   0x1F8U    // Sample Window
#define ADC_PPBTRIP1FILCTL_THRESH_S    9U
#define ADC_PPBTRIP1FILCTL_THRESH_M    0x7E00U   // Majority Voting Threshold
#define ADC_PPBTRIP1FILCTL_FILINIT     0x8000U   // Filter Initialization Bit

//*************************************************************************************************
//
// The following are defines for the bit fields in the ADCPPBTRIP1FILCLKCTL register
//
//*************************************************************************************************
#define ADC_PPBTRIP1FILCLKCTL_CLKPRESCALE_S   0U
#define ADC_PPBTRIP1FILCLKCTL_CLKPRESCALE_M   0xFFFFU   // Filter Clock Prescale

//*************************************************************************************************
//
// The following are defines for the bit fields in the ADCPPB2CONFIG register
//
//*************************************************************************************************
#define ADC_PPB2CONFIG_CONFIG_S     0U
#define ADC_PPB2CONFIG_CONFIG_M     0x1FU    // ADC Post Processing Block 2 Configuration
#define ADC_PPB2CONFIG_CBCEN        0x20U    // Cycle By Cycle Enable
#define ADC_PPB2CONFIG_ABSEN        0x40U    // ADC Post Processing Block 2 Absolute Enable
#define ADC_PPB2CONFIG_TWOSCOMPEN   0x80U    // ADC Post Processing Block 2 Two's Complement Enable
#define ADC_PPB2CONFIG_DELTAEN      0x100U   // ADC Post Processing Block 2 Last Sample Delta
                                             // Enable

//*************************************************************************************************
//
// The following are defines for the bit fields in the ADCPPB2STAMP register
//
//*************************************************************************************************
#define ADC_PPB2STAMP_DLYSTAMP_S   0U
#define ADC_PPB2STAMP_DLYSTAMP_M   0xFFFU   // ADC Post Processing Block 2 Delay Time Stamp

//*************************************************************************************************
//
// The following are defines for the bit fields in the ADCPPB2OFFCAL register
//
//*************************************************************************************************
#define ADC_PPB2OFFCAL_OFFCAL_S   0U
#define ADC_PPB2OFFCAL_OFFCAL_M   0x3FFU   // ADC Post Processing Block Offset Correction

//*************************************************************************************************
//
// The following are defines for the bit fields in the ADCPPB2TRIPHI register
//
//*************************************************************************************************
#define ADC_PPB2TRIPHI_LIMITHI_S   0U
#define ADC_PPB2TRIPHI_LIMITHI_M   0xFFFFFFU   // ADC Post Processing Block 2 Trip High Limit

//*************************************************************************************************
//
// The following are defines for the bit fields in the ADCPPB2TRIPLO register
//
//*************************************************************************************************
#define ADC_PPB2TRIPLO_LIMITLO_S    0U
#define ADC_PPB2TRIPLO_LIMITLO_M    0xFFFFU       // ADC Post Processing Block 2 Trip Low Limit
#define ADC_PPB2TRIPLO_LSIGN        0x10000U      // Low Limit Sign Bit
#define ADC_PPB2TRIPLO_LIMITLO2EN   0x80000U      // Extended Low Limit 2 Enable
#define ADC_PPB2TRIPLO_REQSTAMP_S   20U
#define ADC_PPB2TRIPLO_REQSTAMP_M   0xFFF00000U   // ADC Post Processing Block 2 Request Time Stamp

//*************************************************************************************************
//
// The following are defines for the bit fields in the ADCPPBTRIP2FILCTL register
//
//*************************************************************************************************
#define ADC_PPBTRIP2FILCTL_FILTHIEN    0x1U      // ADCPPB2 TRIPHI Filter Enable
#define ADC_PPBTRIP2FILCTL_FILTLOEN    0x2U      // ADCPPB2 TRIPLO Filter Enable
#define ADC_PPBTRIP2FILCTL_SAMPWIN_S   3U
#define ADC_PPBTRIP2FILCTL_SAMPWIN_M   0x1F8U    // Sample Window
#define ADC_PPBTRIP2FILCTL_THRESH_S    9U
#define ADC_PPBTRIP2FILCTL_THRESH_M    0x7E00U   // Majority Voting Threshold
#define ADC_PPBTRIP2FILCTL_FILINIT     0x8000U   // Filter Initialization Bit

//*************************************************************************************************
//
// The following are defines for the bit fields in the ADCPPBTRIP2FILCLKCTL register
//
//*************************************************************************************************
#define ADC_PPBTRIP2FILCLKCTL_CLKPRESCALE_S   0U
#define ADC_PPBTRIP2FILCLKCTL_CLKPRESCALE_M   0xFFFFU   // Filter Clock Prescale

//*************************************************************************************************
//
// The following are defines for the bit fields in the ADCPPB3CONFIG register
//
//*************************************************************************************************
#define ADC_PPB3CONFIG_CONFIG_S     0U
#define ADC_PPB3CONFIG_CONFIG_M     0x1FU    // ADC Post Processing Block 3 Configuration
#define ADC_PPB3CONFIG_CBCEN        0x20U    // Cycle By Cycle Enable
#define ADC_PPB3CONFIG_ABSEN        0x40U    // ADC Post Processing Block 3 Absolute Enable
#define ADC_PPB3CONFIG_TWOSCOMPEN   0x80U    // ADC Post Processing Block 3 Two's Complement Enable
#define ADC_PPB3CONFIG_DELTAEN      0x100U   // ADC Post Processing Block 3 Last Sample Delta
                                             // Enable

//*************************************************************************************************
//
// The following are defines for the bit fields in the ADCPPB3STAMP register
//
//*************************************************************************************************
#define ADC_PPB3STAMP_DLYSTAMP_S   0U
#define ADC_PPB3STAMP_DLYSTAMP_M   0xFFFU   // ADC Post Processing Block 3 Delay Time Stamp

//*************************************************************************************************
//
// The following are defines for the bit fields in the ADCPPB3OFFCAL register
//
//*************************************************************************************************
#define ADC_PPB3OFFCAL_OFFCAL_S   0U
#define ADC_PPB3OFFCAL_OFFCAL_M   0x3FFU   // ADC Post Processing Block Offset Correction

//*************************************************************************************************
//
// The following are defines for the bit fields in the ADCPPB3TRIPHI register
//
//*************************************************************************************************
#define ADC_PPB3TRIPHI_LIMITHI_S   0U
#define ADC_PPB3TRIPHI_LIMITHI_M   0xFFFFFFU   // ADC Post Processing Block 3 Trip High Limit

//*************************************************************************************************
//
// The following are defines for the bit fields in the ADCPPB3TRIPLO register
//
//*************************************************************************************************
#define ADC_PPB3TRIPLO_LIMITLO_S    0U
#define ADC_PPB3TRIPLO_LIMITLO_M    0xFFFFU       // ADC Post Processing Block 3 Trip Low Limit
#define ADC_PPB3TRIPLO_LSIGN        0x10000U      // Low Limit Sign Bit
#define ADC_PPB3TRIPLO_LIMITLO2EN   0x80000U      // Extended Low Limit 2 Enable
#define ADC_PPB3TRIPLO_REQSTAMP_S   20U
#define ADC_PPB3TRIPLO_REQSTAMP_M   0xFFF00000U   // ADC Post Processing Block 3 Request Time Stamp

//*************************************************************************************************
//
// The following are defines for the bit fields in the ADCPPBTRIP3FILCTL register
//
//*************************************************************************************************
#define ADC_PPBTRIP3FILCTL_FILTHIEN    0x1U      // ADCPPB3 TRIPHI Filter Enable
#define ADC_PPBTRIP3FILCTL_FILTLOEN    0x2U      // ADCPPB3 TRIPLO Filter Enable
#define ADC_PPBTRIP3FILCTL_SAMPWIN_S   3U
#define ADC_PPBTRIP3FILCTL_SAMPWIN_M   0x1F8U    // Sample Window
#define ADC_PPBTRIP3FILCTL_THRESH_S    9U
#define ADC_PPBTRIP3FILCTL_THRESH_M    0x7E00U   // Majority Voting Threshold
#define ADC_PPBTRIP3FILCTL_FILINIT     0x8000U   // Filter Initialization Bit

