TexasInstruments/f29h85x-sdk/source/driverlib/inc/hw_adc.h
//*************************************************************************************************
//
// The following are defines for the bit fields in the ADCPPBTRIP3FILCLKCTL register
//
//*************************************************************************************************
#define ADC_PPBTRIP3FILCLKCTL_CLKPRESCALE_S   0U
#define ADC_PPBTRIP3FILCLKCTL_CLKPRESCALE_M   0xFFFFU   // Filter Clock Prescale

//*************************************************************************************************
//
// The following are defines for the bit fields in the ADCPPB4CONFIG register
//
//*************************************************************************************************
#define ADC_PPB4CONFIG_CONFIG_S     0U
#define ADC_PPB4CONFIG_CONFIG_M     0x1FU    // ADC Post Processing Block 4 Configuration
#define ADC_PPB4CONFIG_CBCEN        0x20U    // Cycle By Cycle Enable
#define ADC_PPB4CONFIG_ABSEN        0x40U    // ADC Post Processing Block 4 Absolute Enable
#define ADC_PPB4CONFIG_TWOSCOMPEN   0x80U    // ADC Post Processing Block 4 Two's Complement Enable
#define ADC_PPB4CONFIG_DELTAEN      0x100U   // ADC Post Processing Block 4 Last Sample Delta
                                             // Enable

//*************************************************************************************************
//
// The following are defines for the bit fields in the ADCPPB4STAMP register
//
//*************************************************************************************************
#define ADC_PPB4STAMP_DLYSTAMP_S   0U
#define ADC_PPB4STAMP_DLYSTAMP_M   0xFFFU   // ADC Post Processing Block 4 Delay Time Stamp

//*************************************************************************************************
//
// The following are defines for the bit fields in the ADCPPB4OFFCAL register
//
//*************************************************************************************************
#define ADC_PPB4OFFCAL_OFFCAL_S   0U
#define ADC_PPB4OFFCAL_OFFCAL_M   0x3FFU   // ADC Post Processing Block Offset Correction

//*************************************************************************************************
//
// The following are defines for the bit fields in the ADCPPB4TRIPHI register
//
//*************************************************************************************************
#define ADC_PPB4TRIPHI_LIMITHI_S   0U
#define ADC_PPB4TRIPHI_LIMITHI_M   0xFFFFFFU   // ADC Post Processing Block 4 Trip High Limit

//*************************************************************************************************
//
// The following are defines for the bit fields in the ADCPPB4TRIPLO register
//
//*************************************************************************************************
#define ADC_PPB4TRIPLO_LIMITLO_S    0U
#define ADC_PPB4TRIPLO_LIMITLO_M    0xFFFFU       // ADC Post Processing Block 4 Trip Low Limit
#define ADC_PPB4TRIPLO_LSIGN        0x10000U      // Low Limit Sign Bit
#define ADC_PPB4TRIPLO_LIMITLO2EN   0x80000U      // Extended Low Limit 2 Enable
#define ADC_PPB4TRIPLO_REQSTAMP_S   20U
#define ADC_PPB4TRIPLO_REQSTAMP_M   0xFFF00000U   // ADC Post Processing Block 4 Request Time Stamp

//*************************************************************************************************
//
// The following are defines for the bit fields in the ADCPPBTRIP4FILCTL register
//
//*************************************************************************************************
#define ADC_PPBTRIP4FILCTL_FILTHIEN    0x1U      // ADCPPB4 TRIPHI Filter Enable
#define ADC_PPBTRIP4FILCTL_FILTLOEN    0x2U      // ADCPPB4 TRIPLO Filter Enable
#define ADC_PPBTRIP4FILCTL_SAMPWIN_S   3U
#define ADC_PPBTRIP4FILCTL_SAMPWIN_M   0x1F8U    // Sample Window
#define ADC_PPBTRIP4FILCTL_THRESH_S    9U
#define ADC_PPBTRIP4FILCTL_THRESH_M    0x7E00U   // Majority Voting Threshold
#define ADC_PPBTRIP4FILCTL_FILINIT     0x8000U   // Filter Initialization Bit

//*************************************************************************************************
//
// The following are defines for the bit fields in the ADCPPBTRIP4FILCLKCTL register
//
//*************************************************************************************************
#define ADC_PPBTRIP4FILCLKCTL_CLKPRESCALE_S   0U
#define ADC_PPBTRIP4FILCLKCTL_CLKPRESCALE_M   0xFFFFU   // Filter Clock Prescale

//*************************************************************************************************
//
// The following are defines for the bit fields in the ADCSAFECHECKRESEN register
//
//*************************************************************************************************
#define ADC_SAFECHECKRESEN_SOC0CHKEN_S    0U
#define ADC_SAFECHECKRESEN_SOC0CHKEN_M    0x3U          // ADC SOC0 Safety Checker Result Enable
#define ADC_SAFECHECKRESEN_SOC1CHKEN_S    2U
#define ADC_SAFECHECKRESEN_SOC1CHKEN_M    0xCU          // ADC SOC1 Safety Checker Result Enable
#define ADC_SAFECHECKRESEN_SOC2CHKEN_S    4U
#define ADC_SAFECHECKRESEN_SOC2CHKEN_M    0x30U         // ADC SOC2 Safety Checker Result Enable
#define ADC_SAFECHECKRESEN_SOC3CHKEN_S    6U
#define ADC_SAFECHECKRESEN_SOC3CHKEN_M    0xC0U         // ADC SOC3 Safety Checker Result Enable
#define ADC_SAFECHECKRESEN_SOC4CHKEN_S    8U
#define ADC_SAFECHECKRESEN_SOC4CHKEN_M    0x300U        // ADC SOC4 Safety Checker Result Enable
#define ADC_SAFECHECKRESEN_SOC5CHKEN_S    10U
#define ADC_SAFECHECKRESEN_SOC5CHKEN_M    0xC00U        // ADC SOC5 Safety Checker Result Enable
#define ADC_SAFECHECKRESEN_SOC6CHKEN_S    12U
#define ADC_SAFECHECKRESEN_SOC6CHKEN_M    0x3000U       // ADC SOC6 Safety Checker Result Enable
#define ADC_SAFECHECKRESEN_SOC7CHKEN_S    14U
#define ADC_SAFECHECKRESEN_SOC7CHKEN_M    0xC000U       // ADC SOC7 Safety Checker Result Enable
#define ADC_SAFECHECKRESEN_SOC8CHKEN_S    16U
#define ADC_SAFECHECKRESEN_SOC8CHKEN_M    0x30000U      // ADC SOC8 Safety Checker Result Enable
#define ADC_SAFECHECKRESEN_SOC9CHKEN_S    18U
#define ADC_SAFECHECKRESEN_SOC9CHKEN_M    0xC0000U      // ADC SOC9 Safety Checker Result Enable
#define ADC_SAFECHECKRESEN_SOC10CHKEN_S   20U
#define ADC_SAFECHECKRESEN_SOC10CHKEN_M   0x300000U     // ADC SOC10 Safety Checker Result Enable
#define ADC_SAFECHECKRESEN_SOC11CHKEN_S   22U
#define ADC_SAFECHECKRESEN_SOC11CHKEN_M   0xC00000U     // ADC SOC11 Safety Checker Result Enable
#define ADC_SAFECHECKRESEN_SOC12CHKEN_S   24U
#define ADC_SAFECHECKRESEN_SOC12CHKEN_M   0x3000000U    // ADC SOC12 Safety Checker Result Enable
#define ADC_SAFECHECKRESEN_SOC13CHKEN_S   26U
#define ADC_SAFECHECKRESEN_SOC13CHKEN_M   0xC000000U    // ADC SOC13 Safety Checker Result Enable
#define ADC_SAFECHECKRESEN_SOC14CHKEN_S   28U
#define ADC_SAFECHECKRESEN_SOC14CHKEN_M   0x30000000U   // ADC SOC14 Safety Checker Result Enable
#define ADC_SAFECHECKRESEN_SOC15CHKEN_S   30U
#define ADC_SAFECHECKRESEN_SOC15CHKEN_M   0xC0000000U   // ADC SOC15 Safety Checker Result Enable

//*************************************************************************************************
//
// The following are defines for the bit fields in the ADCSAFECHECKRESEN2 register
//
//*************************************************************************************************
#define ADC_SAFECHECKRESEN2_SOC16CHKEN_S   0U
#define ADC_SAFECHECKRESEN2_SOC16CHKEN_M   0x3U          // ADC SOC16 Safety Checker Result Enable
#define ADC_SAFECHECKRESEN2_SOC17CHKEN_S   2U
#define ADC_SAFECHECKRESEN2_SOC17CHKEN_M   0xCU          // ADC SOC17 Safety Checker Result Enable
#define ADC_SAFECHECKRESEN2_SOC18CHKEN_S   4U
#define ADC_SAFECHECKRESEN2_SOC18CHKEN_M   0x30U         // ADC SOC18 Safety Checker Result Enable
#define ADC_SAFECHECKRESEN2_SOC19CHKEN_S   6U
#define ADC_SAFECHECKRESEN2_SOC19CHKEN_M   0xC0U         // ADC SOC19 Safety Checker Result Enable
#define ADC_SAFECHECKRESEN2_SOC20CHKEN_S   8U
#define ADC_SAFECHECKRESEN2_SOC20CHKEN_M   0x300U        // ADC SOC20 Safety Checker Result Enable
#define ADC_SAFECHECKRESEN2_SOC21CHKEN_S   10U
#define ADC_SAFECHECKRESEN2_SOC21CHKEN_M   0xC00U        // ADC SOC21 Safety Checker Result Enable
#define ADC_SAFECHECKRESEN2_SOC22CHKEN_S   12U
#define ADC_SAFECHECKRESEN2_SOC22CHKEN_M   0x3000U       // ADC SOC22 Safety Checker Result Enable
#define ADC_SAFECHECKRESEN2_SOC23CHKEN_S   14U
#define ADC_SAFECHECKRESEN2_SOC23CHKEN_M   0xC000U       // ADC SOC23 Safety Checker Result Enable
#define ADC_SAFECHECKRESEN2_SOC24CHKEN_S   16U
#define ADC_SAFECHECKRESEN2_SOC24CHKEN_M   0x30000U      // ADC SOC24 Safety Checker Result Enable
#define ADC_SAFECHECKRESEN2_SOC25CHKEN_S   18U
#define ADC_SAFECHECKRESEN2_SOC25CHKEN_M   0xC0000U      // ADC SOC25 Safety Checker Result Enable
#define ADC_SAFECHECKRESEN2_SOC26CHKEN_S   20U
#define ADC_SAFECHECKRESEN2_SOC26CHKEN_M   0x300000U     // ADC SOC26 Safety Checker Result Enable
#define ADC_SAFECHECKRESEN2_SOC27CHKEN_S   22U
#define ADC_SAFECHECKRESEN2_SOC27CHKEN_M   0xC00000U     // ADC SOC27 Safety Checker Result Enable
#define ADC_SAFECHECKRESEN2_SOC28CHKEN_S   24U
#define ADC_SAFECHECKRESEN2_SOC28CHKEN_M   0x3000000U    // ADC SOC28 Safety Checker Result Enable
#define ADC_SAFECHECKRESEN2_SOC29CHKEN_S   26U
#define ADC_SAFECHECKRESEN2_SOC29CHKEN_M   0xC000000U    // ADC SOC29 Safety Checker Result Enable
#define ADC_SAFECHECKRESEN2_SOC30CHKEN_S   28U
#define ADC_SAFECHECKRESEN2_SOC30CHKEN_M   0x30000000U   // ADC SOC30 Safety Checker Result Enable
#define ADC_SAFECHECKRESEN2_SOC31CHKEN_S   30U
#define ADC_SAFECHECKRESEN2_SOC31CHKEN_M   0xC0000000U   // ADC SOC31 Safety Checker Result Enable

//*************************************************************************************************
//
// The following are defines for the bit fields in the ADCREV2 register
//
//*************************************************************************************************
#define ADC_REV2_WRAPPERTYPE_S   0U
#define ADC_REV2_WRAPPERTYPE_M   0xFFU     // ADC Wrapper Type
#define ADC_REV2_WRAPPERREV_S    8U
#define ADC_REV2_WRAPPERREV_M    0xFF00U   // ADC Wrapper Revision

//*************************************************************************************************
//
// The following are defines for the bit fields in the REP1CTL register
//
//*************************************************************************************************
#define ADC_REP1CTL_MODE          0x1U        // ADC Trigger Repeater 1 Mode Select
#define ADC_REP1CTL_ACTIVEMODE    0x2U        // ADC Trigger Repeater 1 Active Mode
#define ADC_REP1CTL_MODULEBUSY    0x8U        // ADC Trigger Repeater 1 Module Busy
#define ADC_REP1CTL_PHASEOVF      0x40U       // ADC Trigger Repeater 1 Phase Delay Overflow
#define ADC_REP1CTL_TRIGGEROVF    0x80U       // ADC Trigger Repeater 1 Oversampled Trigger
                                              // Overflow
#define ADC_REP1CTL_TRIGGER_S     8U
#define ADC_REP1CTL_TRIGGER_M     0x7F00U     // ADC Trigger Repeater 1 Trigger Select
#define ADC_REP1CTL_SYNCINSEL_S   16U
#define ADC_REP1CTL_SYNCINSEL_M   0x3F0000U   // ADC Trigger Repeater 1 Sync. In Select
#define ADC_REP1CTL_SWSYNC        0x800000U   // ADC Trigger Repeater 1 Software Sync.

//*************************************************************************************************
//
// The following are defines for the bit fields in the REP1N register
//
//*************************************************************************************************
#define ADC_REP1N_NSEL_S     0U
#define ADC_REP1N_NSEL_M     0x7FU       // ADC Trigger Repeater 1 Trigger Number Selection
#define ADC_REP1N_NCOUNT_S   16U
#define ADC_REP1N_NCOUNT_M   0x7F0000U   // ADC Trigger Repeater 1 Trigger Counter

//*************************************************************************************************
//
// The following are defines for the bit fields in the REP1PHASE register
//
//*************************************************************************************************
#define ADC_REP1PHASE_PHASE_S        0U
#define ADC_REP1PHASE_PHASE_M        0xFFFFU       // ADC Trigger Repeater 1 Phase Delay
                                                   // Configuration
#define ADC_REP1PHASE_PHASECOUNT_S   16U
#define ADC_REP1PHASE_PHASECOUNT_M   0xFFFF0000U   // ADC Trigger Repeater 1 Phase Delay Status

//*************************************************************************************************
//
// The following are defines for the bit fields in the REP1SPREAD register
//
//*************************************************************************************************
#define ADC_REP1SPREAD_SPREAD_S        0U
#define ADC_REP1SPREAD_SPREAD_M        0xFFFFU       // ADC Trigger Repeater 1 Spread Delay
                                                     // Configuration
#define ADC_REP1SPREAD_SPREADCOUNT_S   16U
#define ADC_REP1SPREAD_SPREADCOUNT_M   0xFFFF0000U   // ADC Trigger Repeater 1 Spread Delay Status

//*************************************************************************************************
//
// The following are defines for the bit fields in the REP1FRC register
//
//*************************************************************************************************
#define ADC_REP1FRC_SWFRC   0x1U   // ADC Trigger Repeater 1 Software Force

//*************************************************************************************************
//
// The following are defines for the bit fields in the REP2CTL register
//
//*************************************************************************************************
#define ADC_REP2CTL_MODE          0x1U        // ADC Trigger Repeater 2 Mode Select
#define ADC_REP2CTL_ACTIVEMODE    0x2U        // ADC Trigger Repeater 2 Active Mode
#define ADC_REP2CTL_MODULEBUSY    0x8U        // ADC Trigger Repeater 2 Module Busy
#define ADC_REP2CTL_PHASEOVF      0x40U       // ADC Trigger Repeater 2 Phase Delay Overflow
#define ADC_REP2CTL_TRIGGEROVF    0x80U       // ADC Trigger Repeater 2 Oversampled Trigger
                                              // Overflow
#define ADC_REP2CTL_TRIGGER_S     8U
#define ADC_REP2CTL_TRIGGER_M     0x7F00U     // ADC Trigger Repeater 2 Trigger Select
#define ADC_REP2CTL_SYNCINSEL_S   16U
#define ADC_REP2CTL_SYNCINSEL_M   0x3F0000U   // ADC Trigger Repeater 2 Sync. In Select
#define ADC_REP2CTL_SWSYNC        0x800000U   // ADC Trigger Repeater 2 Software Sync.

//*************************************************************************************************
//
// The following are defines for the bit fields in the REP2N register
//
//*************************************************************************************************
#define ADC_REP2N_NSEL_S     0U
#define ADC_REP2N_NSEL_M     0x7FU       // ADC Trigger Repeater 2 Trigger Number Selection
#define ADC_REP2N_NCOUNT_S   16U
#define ADC_REP2N_NCOUNT_M   0x7F0000U   // ADC Trigger Repeater 2 Trigger Counter

//*************************************************************************************************
//
// The following are defines for the bit fields in the REP2PHASE register
//
//*************************************************************************************************
#define ADC_REP2PHASE_PHASE_S        0U
#define ADC_REP2PHASE_PHASE_M        0xFFFFU       // ADC Trigger Repeater 2 Phase Delay
                                                   // Configuration
#define ADC_REP2PHASE_PHASECOUNT_S   16U
#define ADC_REP2PHASE_PHASECOUNT_M   0xFFFF0000U   // ADC Trigger Repeater 2 Phase Delay Status

//*************************************************************************************************
//
// The following are defines for the bit fields in the REP2SPREAD register
//
//*************************************************************************************************
#define ADC_REP2SPREAD_SPREAD_S        0U
#define ADC_REP2SPREAD_SPREAD_M        0xFFFFU       // ADC Trigger Repeater 2 Spread Delay
                                                     // Configuration
#define ADC_REP2SPREAD_SPREADCOUNT_S   16U
#define ADC_REP2SPREAD_SPREADCOUNT_M   0xFFFF0000U   // ADC Trigger Repeater 2 Spread Delay Status

//*************************************************************************************************
//
// The following are defines for the bit fields in the REP2FRC register
//
//*************************************************************************************************
#define ADC_REP2FRC_SWFRC   0x1U   // ADC Trigger Repeater 2 Software Force

//*************************************************************************************************
//
// The following are defines for the bit fields in the ADCPPB1LIMIT register
//
//*************************************************************************************************
#define ADC_PPB1LIMIT_LIMIT_S   0U
#define ADC_PPB1LIMIT_LIMIT_M   0x3FFU   // Post Processing Block 1 Limit

//*************************************************************************************************
//
// The following are defines for the bit fields in the ADCPPBP1PCOUNT register
//
//*************************************************************************************************
#define ADC_PPBP1PCOUNT_PCOUNT_S   0U
#define ADC_PPBP1PCOUNT_PCOUNT_M   0x3FFU   // Post Processing Block 1 Partial Count

//*************************************************************************************************
//
// The following are defines for the bit fields in the ADCPPB1CONFIG2 register
//
//*************************************************************************************************
#define ADC_PPB1CONFIG2_SHIFT_S       0U
#define ADC_PPB1CONFIG2_SHIFT_M       0xFU      // Post Processing Block 1 Right Shift
#define ADC_PPB1CONFIG2_SYNCINSEL_S   4U
#define ADC_PPB1CONFIG2_SYNCINSEL_M   0x3F0U    // Post Processing Block 1 Sync. Input Select
#define ADC_PPB1CONFIG2_SWSYNC        0x800U    // Post Processing Block 1 Software Force Sync.
#define ADC_PPB1CONFIG2_OSINTSEL      0x1000U   // Post Processing Block 1 Interrupt Source Select
#define ADC_PPB1CONFIG2_COMPSEL_S     14U
#define ADC_PPB1CONFIG2_COMPSEL_M     0xC000U   // Post Processing Block 1 Compare Source Select

//*************************************************************************************************
//
// The following are defines for the bit fields in the ADCPPB1PSUM register
//
//*************************************************************************************************
#define ADC_PPB1PSUM_PSUM_S   0U
#define ADC_PPB1PSUM_PSUM_M   0xFFFFFFU     // Post Processing Block 1 Oversampling Partial Sum
#define ADC_PPB1PSUM_SIGN_S   24U
#define ADC_PPB1PSUM_SIGN_M   0xFF000000U   // Sign Extended Bits

//*************************************************************************************************
//
// The following are defines for the bit fields in the ADCPPB1PMAX register
//
//*************************************************************************************************
#define ADC_PPB1PMAX_PMAX_S   0U
#define ADC_PPB1PMAX_PMAX_M   0x1FFFFU      // Post Processing Block 1 Oversampling Partial Max
#define ADC_PPB1PMAX_SIGN_S   17U
#define ADC_PPB1PMAX_SIGN_M   0xFFFE0000U   // Sign Extended Bits

//*************************************************************************************************
//
// The following are defines for the bit fields in the ADCPPB1PMAXI register
//
//*************************************************************************************************
#define ADC_PPB1PMAXI_PMAXI_S   0U
#define ADC_PPB1PMAXI_PMAXI_M   0x3FFU   // Post Processing Block 1 Oversampling Partial Index of
                                         // Max

//*************************************************************************************************
//
// The following are defines for the bit fields in the ADCPPB1PMIN register
//
//*************************************************************************************************
#define ADC_PPB1PMIN_PMIN_S   0U
#define ADC_PPB1PMIN_PMIN_M   0x1FFFFU      // Post Processing Block 1 Oversampling Partial Min
#define ADC_PPB1PMIN_SIGN_S   17U
#define ADC_PPB1PMIN_SIGN_M   0xFFFE0000U   // Sign Extended Bits

//*************************************************************************************************
//
// The following are defines for the bit fields in the ADCPPB1PMINI register
//
//*************************************************************************************************
#define ADC_PPB1PMINI_PMINI_S   0U
#define ADC_PPB1PMINI_PMINI_M   0x3FFU   // Post Processing Block 1 Oversampling Partial Index of
                                         // Min

//*************************************************************************************************
//
// The following are defines for the bit fields in the ADCPPB1TRIPLO2 register
//
//*************************************************************************************************
#define ADC_PPB1TRIPLO2_LIMITLO_S   0U
#define ADC_PPB1TRIPLO2_LIMITLO_M   0xFFFFFFU   // ADC Post Processing Block 1 Trip Low Limit

//*************************************************************************************************
//
// The following are defines for the bit fields in the ADCPPB2LIMIT register
//
//*************************************************************************************************
#define ADC_PPB2LIMIT_LIMIT_S   0U
#define ADC_PPB2LIMIT_LIMIT_M   0x3FFU   // Post Processing Block 2 Limit

//*************************************************************************************************
//
// The following are defines for the bit fields in the ADCPPBP2PCOUNT register
//
//*************************************************************************************************
#define ADC_PPBP2PCOUNT_PCOUNT_S   0U
#define ADC_PPBP2PCOUNT_PCOUNT_M   0x3FFU   // Post Processing Block 2 Partial Count

//*************************************************************************************************
//
// The following are defines for the bit fields in the ADCPPB2CONFIG2 register
//
//*************************************************************************************************
#define ADC_PPB2CONFIG2_SHIFT_S       0U
#define ADC_PPB2CONFIG2_SHIFT_M       0xFU      // Post Processing Block 2 Right Shift
#define ADC_PPB2CONFIG2_SYNCINSEL_S   4U
#define ADC_PPB2CONFIG2_SYNCINSEL_M   0x3F0U    // Post Processing Block 2 Sync. Input Select
#define ADC_PPB2CONFIG2_SWSYNC        0x800U    // Post Processing Block 2 Software Force Sync.
#define ADC_PPB2CONFIG2_OSINTSEL      0x1000U   // Post Processing Block 2 Interrupt Source Select
#define ADC_PPB2CONFIG2_COMPSEL_S     14U
#define ADC_PPB2CONFIG2_COMPSEL_M     0xC000U   // Post Processing Block 2 Compare Source Select

//*************************************************************************************************
//
// The following are defines for the bit fields in the ADCPPB2PSUM register
//
//*************************************************************************************************
#define ADC_PPB2PSUM_PSUM_S   0U
#define ADC_PPB2PSUM_PSUM_M   0xFFFFFFU     // Post Processing Block 2 Oversampling Partial Sum
#define ADC_PPB2PSUM_SIGN_S   24U
#define ADC_PPB2PSUM_SIGN_M   0xFF000000U   // Sign Extended Bits

//*************************************************************************************************
//
// The following are defines for the bit fields in the ADCPPB2PMAX register
//
//*************************************************************************************************
#define ADC_PPB2PMAX_PMAX_S   0U
#define ADC_PPB2PMAX_PMAX_M   0x1FFFFU      // Post Processing Block 2 Oversampling Partial Max
#define ADC_PPB2PMAX_SIGN_S   17U
#define ADC_PPB2PMAX_SIGN_M   0xFFFE0000U   // Sign Extended Bits

